{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "import pandas as pd"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "pd.set_option('display.max_rows', 5)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [],
   "source": [
    "URI = \"neo4j://localhost:7999\"\n",
    "AUTH = (\"neo4j\", \"password\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>title</th>\n",
       "      <th>series</th>\n",
       "      <th>author</th>\n",
       "      <th>genres</th>\n",
       "      <th>pages</th>\n",
       "      <th>publishDate</th>\n",
       "      <th>publishYear</th>\n",
       "      <th>rating</th>\n",
       "      <th>likedPercent</th>\n",
       "      <th>price</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Manhood Of Humanity - The Science And Art Of H...</td>\n",
       "      <td>standalone</td>\n",
       "      <td>Alfred Korkzybski</td>\n",
       "      <td>['Science']</td>\n",
       "      <td>280</td>\n",
       "      <td>April 4th 2010</td>\n",
       "      <td>2010</td>\n",
       "      <td>5.00</td>\n",
       "      <td>100.0</td>\n",
       "      <td>22.40</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>CIRCUS RIDER</td>\n",
       "      <td>standalone</td>\n",
       "      <td>Peter Breschard</td>\n",
       "      <td>['Historical Fiction']</td>\n",
       "      <td>330</td>\n",
       "      <td>December 15th 2010</td>\n",
       "      <td>2010</td>\n",
       "      <td>5.00</td>\n",
       "      <td>100.0</td>\n",
       "      <td>19.59</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>998</th>\n",
       "      <td>Konin: A Quest</td>\n",
       "      <td>standalone</td>\n",
       "      <td>Theo Richmond</td>\n",
       "      <td>['Holocaust', 'History', 'Nonfiction', 'Jewish...</td>\n",
       "      <td>448</td>\n",
       "      <td>August 29th 1995</td>\n",
       "      <td>1995</td>\n",
       "      <td>4.46</td>\n",
       "      <td>99.0</td>\n",
       "      <td>2.77</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>999</th>\n",
       "      <td>The Black Flamingo</td>\n",
       "      <td>standalone</td>\n",
       "      <td>Dean Atta</td>\n",
       "      <td>['Poetry', 'Young Adult', 'LGBT', 'Contemporar...</td>\n",
       "      <td>360</td>\n",
       "      <td>August 8th 2019</td>\n",
       "      <td>2019</td>\n",
       "      <td>4.46</td>\n",
       "      <td>99.0</td>\n",
       "      <td>12.06</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1000 rows × 10 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                 title      series  \\\n",
       "0    Manhood Of Humanity - The Science And Art Of H...  standalone   \n",
       "1                                         CIRCUS RIDER  standalone   \n",
       "..                                                 ...         ...   \n",
       "998                                     Konin: A Quest  standalone   \n",
       "999                                 The Black Flamingo  standalone   \n",
       "\n",
       "                author                                             genres  \\\n",
       "0    Alfred Korkzybski                                        ['Science']   \n",
       "1      Peter Breschard                             ['Historical Fiction']   \n",
       "..                 ...                                                ...   \n",
       "998      Theo Richmond  ['Holocaust', 'History', 'Nonfiction', 'Jewish...   \n",
       "999          Dean Atta  ['Poetry', 'Young Adult', 'LGBT', 'Contemporar...   \n",
       "\n",
       "     pages         publishDate  publishYear  rating  likedPercent  price  \n",
       "0      280      April 4th 2010         2010    5.00         100.0  22.40  \n",
       "1      330  December 15th 2010         2010    5.00         100.0  19.59  \n",
       "..     ...                 ...          ...     ...           ...    ...  \n",
       "998    448    August 29th 1995         1995    4.46          99.0   2.77  \n",
       "999    360     August 8th 2019         2019    4.46          99.0  12.06  \n",
       "\n",
       "[1000 rows x 10 columns]"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "dataset = pd.read_csv(\"./BestBooksEverClean.csv\")\n",
    "dataset"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### From String list, return the list of genres"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "def genres_to_list(genres: str) -> list:\n",
    "  list_of_genres = genres.removeprefix('[').removesuffix(']').split(', ')\n",
    "  return list(map(lambda s: s[1:][:-1], list_of_genres))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "list"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "dataset[\"genres\"] = dataset[\"genres\"].apply(genres_to_list)\n",
    "type(dataset['genres'].iloc[0])"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Enable Connection"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [],
   "source": [
    "driver = GraphDatabase.driver(URI, auth=AUTH)\n",
    "session = driver.session()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {},
   "outputs": [],
   "source": [
    "def insert_user(name: str) -> bool:\n",
    "  # Insertar usuario\n",
    "  result = session.run(f\"MATCH (u:User) WHERE u.name = $name RETURN u.name as name\", {\"name\": name})\n",
    "  if len(result.data()) == 0:\n",
    "    try:\n",
    "      session.run(\"CREATE (u:User {name: $name})\", {\"name\": name})\n",
    "      return True\n",
    "    except:\n",
    "      pass\n",
    "  return False\n",
    "\n",
    "def show_users():\n",
    "  # Mostrar usuarios\n",
    "  print(\"Usuarios:\")\n",
    "  result = session.run(\"MATCH (u:User) RETURN u.name AS name\")\n",
    "  for record in result:\n",
    "    print(f\" - {record[\"name\"]}\")\n",
    "\n",
    "def show_connections():\n",
    "  # Mostrar vinculos\n",
    "  print(\"\\nVinculos:\")\n",
    "  result = session.run(\"MATCH (u:User)-[r:FRIEND]->(u2:User) RETURN u.name AS name, u2.name AS name2\")\n",
    "  for record in result:\n",
    "    print(f\" - {record['name']} es amigo de {record['name2']}\")\n",
    "\n",
    "def insert_author(author: str) -> bool:\n",
    "  # Insertar autor\n",
    "  result = session.run(\"MATCH (a:Author) WHERE a.name = $name RETURN a.name as name\", {\"name\": author})\n",
    "  if len(result.data()) == 0:\n",
    "    try:\n",
    "      session.run(\"CREATE (a:Author {name: $name})\", {\"name\": author})\n",
    "      return True\n",
    "    except:\n",
    "      pass\n",
    "  return False\n",
    "\n",
    "def show_authors():\n",
    "  # Mostrar autores\n",
    "  print(\"Autores:\")\n",
    "  result = session.run(\"MATCH (a:Author) RETURN a.name AS name\")\n",
    "  for record in result:\n",
    "    print(f\" - {record[\"name\"]}\")\n",
    "\n",
    "def insert_genre(genre: str) -> bool:\n",
    "  # Insertar Genero\n",
    "  result = session.run(\"MATCH (g:Genre) WHERE g.name = $name RETURN g.name as name\", {\"name\": genre})\n",
    "  if len(result.data()) == 0:\n",
    "    try:\n",
    "      session.run(\"CREATE (g:Genre {name: $name})\", {\"name\": genre})\n",
    "      return True\n",
    "    except:\n",
    "      pass\n",
    "  return False\n",
    "\n",
    "def show_genres():\n",
    "  # Mostrar generos\n",
    "  print(\"Generos:\")\n",
    "  result = session.run(\"MATCH (g:Genre) RETURN g.name AS name\")\n",
    "  for record in result:\n",
    "    print(f\" - {record[\"name\"]}\")\n",
    "\n",
    "def insert_books(books: pd.DataFrame) -> bool:\n",
    "  # Insertar libros\n",
    "  query = \"\"\"\n",
    "    UNWIND $books AS book\n",
    "    MERGE (b:Book {title: book.title})\n",
    "    ON CREATE SET b.author = book.author, \n",
    "                  b.pages = book.pages, b.rating = book.rating, b.likedPercent = book.likedPercent, \n",
    "                  b.numRating = book.numRating, b.price = book.price, b.publishDate = book.publishDate, \n",
    "                  b.publishYear = book.publishYear\n",
    "    \"\"\"\n",
    "  \n",
    "  try:\n",
    "    books_dict = books.to_dict('records')\n",
    "    session.run(query, {\"books\": books_dict})\n",
    "    return True\n",
    "  except:\n",
    "    pass\n",
    "  return False\n",
    "\n",
    "def get_random_books(n: int):\n",
    "  query = f\"\"\"\n",
    "    MATCH (b:Book)\n",
    "    RETURN b.title AS title, b.author AS author, b.pages AS pages,\n",
    "           b.rating AS rating, b.likedPercent AS likedPercent, b.numRating AS numRating,\n",
    "           b.price AS price, b.publishDate AS publishDate, b.publishYear AS publishYear\n",
    "    ORDER BY rand()\n",
    "    LIMIT {n}\n",
    "    \"\"\"\n",
    "  result = session.run(query)\n",
    "  books = result.data()\n",
    "  return books\n",
    "\n",
    "def make_relation(a_name: str, a_type: str, b_name: str, b_type: str, relation: str) -> bool:\n",
    "  # Crear una relacion\n",
    "  query = \"MATCH (a:\" + a_type + \" {name: $a_name}),\"\\\n",
    "        +       \"(b:\" + b_type + \" {name: $b_name})\"\\\n",
    "        + \"CREATE (a)-[:\" + relation + \"]->(b)\"\n",
    "  attr = {\n",
    "    \"a_name\": a_name, \n",
    "    \"b_name\": b_name\n",
    "    }\n",
    "  \n",
    "  try:\n",
    "    session.run(query, attr)\n",
    "    return True\n",
    "  except:\n",
    "    pass\n",
    "  return False\n",
    "\n",
    "def book_genre_relationship(tx, book_title: str, genres: list[str]) -> bool:\n",
    "  for genre in genres:\n",
    "    query = (\n",
    "              \"MATCH (b:Book {title: $book_title}), (g:Genre {name: $genre}) \"\n",
    "              \"CREATE (b)-[:BELONGS_TO]->(g)\"\n",
    "          )\n",
    "    tx.run(query, book_title=book_title, genre=genre)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Insert Users"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [],
   "source": [
    "users = [\n",
    "  'Victor',\n",
    "  'Badre',\n",
    "  'Daniel',\n",
    "  'Adrian',\n",
    "  'Manuel',\n",
    "  'Angel',\n",
    "  'Felix',\n",
    "  'Fernando'\n",
    "]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [],
   "source": [
    "for user in users:\n",
    "  insert_user(user)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Usuarios:\n",
      " - Victor\n",
      " - Badre\n",
      " - Daniel\n",
      " - Adrian\n",
      " - Manuel\n",
      " - Angel\n",
      " - Felix\n",
      " - Fernando\n"
     ]
    }
   ],
   "source": [
    "show_users()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Insert authors"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [],
   "source": [
    "for author in dataset['author'].unique():\n",
    "  insert_author(author)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Autores:\n",
      " - Alfred Korkzybski\n",
      " - Peter Breschard\n",
      " - Ocelot Emerson\n",
      " - Tina M. Randolph\n",
      " - Richard Atwood\n",
      " - Jerry Seguin\n",
      " - Violet's Vegan Comics\n",
      " - Ki Longfellow\n",
      " - Ruth Watson-Morris\n",
      " - Steve Julien\n",
      " - Ali Marsman\n",
      " - Hudith F. Dolkart\n",
      " - Brae Wyckoff\n",
      " - Sita Bennett\n",
      " - Jacob Lasher\n",
      " - Bernie Morris\n",
      " - Rohith S. Katbamna\n",
      " - Martha A. Cheves\n",
      " - Jo-Anne McArthur\n",
      " - Bill Watterson\n",
      " - Francis Shenstone\n",
      " - J.D. Estrada\n",
      " - Aimee Lewis\n",
      " - Brandon Sanderson\n",
      " - William Shakespeare\n",
      " - Victoria Botkin\n",
      " - Anonymous\n",
      " - Rachna Khemchandani\n",
      " - Janet G. Travell\n",
      " - Pythia Peay\n",
      " - Banani Ray\n",
      " - J.K. Rowling\n",
      " - Laurick Ingram\n",
      " - G.B. Hope\n",
      " - George Herriman\n",
      " - George Mendoza\n",
      " - Lawrence Hole\n",
      " - Francine Rivers\n",
      " - Neil Gaiman\n",
      " - Fletcher McHale\n",
      " - Marika Germanis\n",
      " - Amit Ray\n",
      " - Georg Trakl\n",
      " - Andrew Peterson\n",
      " - Rich Okun\n",
      " - S.F. Mazhar\n",
      " - Gary Collins\n",
      " - Rien Poortvliet\n",
      " - Nick Brandt\n",
      " - Sue Lloyd-Roberts\n",
      " - Teric Darken\n",
      " - Sarah J. Maas\n",
      " - Michelle R. Eastman\n",
      " - Karen Kingsbury\n",
      " - Amanda Barratt\n",
      " - Lisa McMann\n",
      " - John Williams\n",
      " - The Church of Jesus Christ of Latter-day Saints\n",
      " - John Andrew Simpson\n",
      " - Colleen Thatcher\n",
      " - Julie Morgan\n",
      " - Phil Hardy\n",
      " - Bhikkhu Bodhi\n",
      " - Richard Fenton\n",
      " - John Fitzgerald\n",
      " - Phil Hunt\n",
      " - Renée Paule\n",
      " - Anna Othitis\n",
      " - Bryon MacWilliams\n",
      " - Ringo Gene Hayden\n",
      " - Joe Connolly\n",
      " - Marissa Meyer\n",
      " - Hugh Behm-Steinberg\n",
      " - Robin Stevens\n",
      " - Erin Hunter\n",
      " - Mark Crilley\n",
      " - Patrick O'Brian\n",
      " - Bahá'u'lláh\n",
      " - Pamela Kribbe\n",
      " - Idries Shah\n",
      " - Dorothy Dunnett\n",
      " - Martin Luther King Jr.\n",
      " - Shinry\n",
      " - Tamera Alexander\n",
      " - Ngaire Elder\n",
      " - Hayao Miyazaki\n",
      " - Eiichiro Oda\n",
      " - Alex Hirsch\n",
      " - Henri Cartier-Bresson\n",
      " - J.R. Ward\n",
      " - Lucy Score\n",
      " - Gary Larson\n",
      " - Alessandro Boccaletti\n",
      " - Annette Marie\n",
      " - Ann Joslin Williams\n",
      " - Michael Rickard\n",
      " - Frank Stanford\n",
      " - Don Rosa\n",
      " - Jeff W. Horton\n",
      " - Deja King\n",
      " - Frances J. Roberts\n",
      " - Andrew Hussie\n",
      " - Joss Stirling\n",
      " - Jean Noli\n",
      " - Tony Cartalucci\n",
      " - Jane Bettany\n",
      " - Bruce Robinson\n",
      " - Ward Foley\n",
      " - David Allen Sibley\n",
      " - David Vance\n",
      " - Harold Klemp\n",
      " - Jackie Wang\n",
      " - Robin Jones Gunn\n",
      " - Joseph Stroud\n",
      " - Rich Mullins\n",
      " - Doris Burn\n",
      " - Hiroshi Sugimoto\n",
      " - Michael D. O'Brien\n",
      " - One Direction\n",
      " - Michelle Paver\n",
      " - Swami Venkatesananda\n",
      " - Ellen G. White\n",
      " - Roald Dahl\n",
      " - Ashley Antoinette\n",
      " - Joseph L. Henderson\n",
      " - Radhanath Swami\n",
      " - Robert Kirkman\n",
      " - Alexei Maxim Russell\n",
      " - Kentaro Miura\n",
      " - Daniel Pinkwater\n",
      " - Helen Roseveare\n",
      " - Maya Angelou\n",
      " - Michael Dante DiMartino\n",
      " - Robin Hobb\n",
      " - Jill Barklem\n",
      " - Courtney Maum\n",
      " - Sarah Moon\n",
      " - Alice Oseman\n",
      " - Mark Mabry\n",
      " - Stephen Skinner\n",
      " - Iris Muller-Westermann\n",
      " - Hafez\n",
      " - Lynette Noni\n",
      " - Alisa Kwitney\n",
      " - George R.R. Martin\n",
      " - Carole Devine\n",
      " - Jennifer L. Armentrout\n",
      " - Gleb Tsipursky\n",
      " - Dave Jacke\n",
      " - James Thurber\n",
      " - Gordon B. Hinckley\n",
      " - Rick Renner\n",
      " - Karen M. Fjeldheim\n",
      " - Tui T. Sutherland\n",
      " - Tom DeLonge\n",
      " - David A. Bednar\n",
      " - Derek Landy\n",
      " - Anthony Ray Hinton\n",
      " - Herbert Coleridge\n",
      " - Gordy Marshall\n",
      " - Joyce Mitchell\n",
      " - Maria Johnsen\n",
      " - Andrew C. Skinner\n",
      " - James E. Talmage\n",
      " - Alice O. Howell\n",
      " - Muhammad Bin Jamil Zeno\n",
      " - Angela Dolbear\n",
      " - Rainer Maria Rilke\n",
      " - S.D. Smith\n",
      " - Jean Baptiste Saint-Jure\n",
      " - Dave Hunt\n",
      " - D. Martyn Lloyd-Jones\n",
      " - Richelle Mead\n",
      " - Jim Butcher\n",
      " - Charles M. Schulz\n",
      " - Hiromu Arakawa\n",
      " - Odysseus Elytis\n",
      " - Andrew Williamson\n",
      " - Laura Sobiech\n",
      " - David Benioff\n",
      " - Robert Jordan\n",
      " - Shannon Messenger\n",
      " - Masatoshi Kusakabe\n",
      " - Richard P. Feynman\n",
      " - Celia Hawkesworth\n",
      " - Abu Hamid al-Ghazali\n",
      " - Marilyn Boyer\n",
      " - Mary Oliver\n",
      " - Cassandra Clare\n",
      " - Christopher Yost\n",
      " - Michael Phillip Cash\n",
      " - Jessica Shirvington\n",
      " - Kiera Cass\n",
      " - Molly Evangeline\n",
      " - Justin Bieber\n",
      " - J.R.R. Tolkien\n",
      " - Charlie Mackesy\n",
      " - Rebecca Donovan\n",
      " - Bryan Stevenson\n",
      " - Virginia McKevitt\n",
      " - Thomas L. Trevethan\n",
      " - Pope John Paul II\n",
      " - John Rule\n",
      " - Conrad Aiken\n",
      " - Frank Miller\n",
      " - Joseph Smith Jr.\n",
      " - Marie Lu\n",
      " - ابن كثير\n",
      " - T.B. Solangel\n",
      " - Treasure Hernandez\n",
      " - Edward Reese\n",
      " - James Vella-Bardon\n",
      " - Warren Buffett\n",
      " - Raymond Carver\n",
      " - Tamora Pierce\n",
      " - Jennifer Li Shotz\n",
      " - R.A. Salvatore\n",
      " - Rick Riordan\n",
      " - Akala\n",
      " - Patricia Lee Gauch\n",
      " - Taylor Swift\n",
      " - Peggy Bacon\n",
      " - Patricia Briggs\n",
      " - Chris Pérez\n",
      " - Belzebuub\n",
      " - Neal Shusterman\n",
      " - Beth Moore\n",
      " - Cyma Rubin\n",
      " - Maurice Sendak\n",
      " - Nâzım Hikmet Ran\n",
      " - James S.A. Corey\n",
      " - Alla Danishevsky\n",
      " - E.W. Kenyon\n",
      " - Takerra Allen\n",
      " - Jorge Luis Borges\n",
      " - Brandon Mull\n",
      " - James Ponti\n",
      " - Jody Carrington\n",
      " - Brant Pitre\n",
      " - Bob Dylan\n",
      " - Morton Feldman\n",
      " - Hanif Abdurraqib\n",
      " - Konami Sonoda\n",
      " - Tiffany Reisz\n",
      " - Sherrilyn Kenyon\n",
      " - Bruce Lee Bond\n",
      " - Augustine Martin\n",
      " - Nancy Parent\n",
      " - Janie Pendleton\n",
      " - Martin Lings\n",
      " - Trenton Lee Stewart\n",
      " - Wole Akosile\n",
      " - Ilona Andrews\n",
      " - Owen Mullen\n",
      " - Thomas R. Holtz Jr.\n",
      " - Satyajit Ray\n",
      " - Eknath Easwaran\n",
      " - Alexis Pauline Gumbs\n",
      " - Stephen King\n",
      " - Kristin Hannah\n",
      " - Gary Russell\n",
      " - Primo Levi\n",
      " - Fletcher DeLancey\n",
      " - Anne Zoelle\n",
      " - Marcel Proust\n",
      " - Shoghi Effendi\n",
      " - Adèle Geras\n",
      " - Sheri Dew\n",
      " - Maria Faustyna Kowalska\n",
      " - Rebecca Sugar\n",
      " - Chris Colfer\n",
      " - Neal A. Maxwell\n",
      " - Jane Austen\n",
      " - Victor Mollo\n",
      " - Patrick Rothfuss\n",
      " - Ian W. Toll\n",
      " - Jennifer Lynn Alvarez\n",
      " - William H. Brewer\n",
      " - Russell T. Davies\n",
      " - Bruce D. Perry\n",
      " - Ida B. Wells-Barnett\n",
      " - Andrew Murray\n",
      " - Roy Glenn\n",
      " - Pope Paul VI\n",
      " - Bibhutibhushan Bandyopadhyay\n",
      " - Jane Roberts\n",
      " - Kenneth Jarrett Singleton\n",
      " - Kanata Konami\n",
      " - Robin Wall Kimmerer\n",
      " - Dale Pendell\n",
      " - Sangharakshita\n",
      " - Aaron B. Powell\n",
      " - Gerald N. Lund\n",
      " - Maud Hart Lovelace\n",
      " - Eric Blehm\n",
      " - Jaye L. Knight\n",
      " - Douglas Adams\n",
      " - Stephen Moss\n",
      " - Arthur Bennett\n",
      " - ShelFoote\n",
      " - Michael Wood\n",
      " - S.A. Chakraborty\n",
      " - Karen Tyrrell\n",
      " - Victoria Wood\n",
      " - Michael J. Sullivan\n",
      " - Sri Sri Ravi Shankar\n",
      " - Kate Petty\n",
      " - Jenny Twist\n",
      " - Kiyohiko Azuma\n",
      " - Connilyn Cossette\n",
      " - Conrad Richter\n",
      " - Edgar Allan Poe\n",
      " - Charles Haddon Spurgeon\n",
      " - Art Spiegelman\n",
      " - Aristotle\n",
      " - Darlene Deibler Rose\n",
      " - Sharon Lee\n",
      " - Brandon Stanton\n",
      " - Armando Cosani\n",
      " - Susan M. Boyer\n",
      " - Amber Rose\n",
      " - Patricia Polacco\n",
      " - K.C. Lynn\n",
      " - Julie Kagawa\n",
      " - Eduardo Galeano\n",
      " - Heather Brewer\n",
      " - Dave Ramsey\n",
      " - Catherine M. Wilson\n",
      " - Ernest K. Gann\n",
      " - Wendell Berry\n",
      " - Hajime Isayama\n",
      " - Stjepan Šejić\n",
      " - John Lewis\n",
      " - Meša Selimović\n",
      " - A.C. Bhaktivedanta Swami Prabhupāda\n",
      " - Joe Egly\n",
      " - M. Sweeney\n",
      " - Mark McLaughlin\n",
      " - Pénélope Bagieu\n",
      " - Dan Crenshaw\n",
      " - Ted Dekker\n",
      " - Alisa Mullen\n",
      " - Svetlana Amelekhina\n",
      " - Carmen Maria Machado\n",
      " - Audre Lorde\n",
      " - Michael S. Heiser\n",
      " - Peter Menzel\n",
      " - Anton Chekhov\n",
      " - Jay Kristoff\n",
      " - J.D. Robb\n",
      " - John Green\n",
      " - Silvia Federici\n",
      " - Robert L. Millet\n",
      " - William Horwood\n",
      " - Mikhail Tal\n",
      " - Watty Piper\n",
      " - N.T. Wright\n",
      " - Toni Weschler\n",
      " - Laurell K. Hamilton\n",
      " - Brian K. Vaughan\n",
      " - Zia Mahmood\n",
      " - Benedict XVI\n",
      " - Naoki Urasawa\n",
      " - A.A. Milne\n",
      " - Catherine West\n",
      " - Tsugumi Ohba\n",
      " - Javan\n",
      " - Scott Meredith\n",
      " - Wendy Pini\n",
      " - Tara Bennett\n",
      " - Deborah Harkness\n",
      " - Diana Gabaldon\n",
      " - Tim Burton\n",
      " - Svetlana Alexievich\n",
      " - C.G. Jung\n",
      " - Garth Nix\n",
      " - Sheryl Kahn\n",
      " - Amie Kaufman\n",
      " - Kate O'Hearn\n",
      " - Malvina G. Vogel\n",
      " - Cathy Glass\n",
      " - Charles T. Munger\n",
      " - Andrei Tarkovsky\n",
      " - L.J. Smith\n",
      " - John W. Trimmer\n",
      " - Angie Thomas\n",
      " - Carl Barks\n",
      " - Wendy Alec\n",
      " - Agatha Christie\n",
      " - Lois McMaster Bujold\n",
      " - Frank Sheed\n",
      " - Louis de Montfort\n",
      " - Jamie Sams\n",
      " - Jonathan Lynn\n",
      " - Roberto Juarroz\n",
      " - Ernesto Cisneros\n",
      " - Chimamanda Ngozi Adichie\n",
      " - Gavin Aung Than\n",
      " - Holly Jackson\n",
      " - Inbali Iserles\n",
      " - Sapan Saxena\n",
      " - Abolqasem Ferdowsi\n",
      " - Max Lucado\n",
      " - Kate Egan\n",
      " - Jim Beaver\n",
      " - Brian Sibley\n",
      " - Marie-Louise von Franz\n",
      " - Ronie Kendig\n",
      " - Charlie Kaufman\n",
      " - Mihai Eminescu\n",
      " - Phil Vischer\n",
      " - Rachel Caine\n",
      " - Aka Akasaka\n",
      " - Shaun Tan\n",
      " - Jessica Townsend\n",
      " - Smith Wigglesworth\n",
      " - Dario Marianelli\n",
      " - Tracy Brown\n",
      " - Osho\n",
      " - Flannery O'Connor\n",
      " - Meher Baba\n",
      " - Warren Ellis\n",
      " - Valentin Tomberg\n",
      " - Edward L. Kimball\n",
      " - Mark Greaney\n",
      " - Haing Ngor\n",
      " - David Foster Wallace\n",
      " - Henry B. Eyring\n",
      " - Ryōkan\n",
      " - Billy Graham\n",
      " - Arthur Conan Doyle\n",
      " - Jerry Cook\n",
      " - Warren H. Carroll\n",
      " - Fernando Pessoa\n",
      " - Raymond Holliwell\n",
      " - Guy Johnson\n",
      " - Jan Valtin\n",
      " - Kelly Rimmer\n",
      " - George MacDonald\n",
      " - Donalyn Miller\n",
      " - Muna Imady\n",
      " - Sarah Dessen\n",
      " - Westminster Assembly\n",
      " - Simon Marsden\n",
      " - Saiber\n",
      " - Cherise Sinclair\n",
      " - Jun Mochizuki\n",
      " - Katsuhiro Otomo\n",
      " - Jackie Castle\n",
      " - Brandon Thomas DiSabatino\n",
      " - Christopher Ash\n",
      " - Stephen E. Robinson\n",
      " - Henryk Grossmann\n",
      " - Marshal Younger\n",
      " - Rinko Kawauchi\n",
      " - Lian Tanner\n",
      " - Sarah Young\n",
      " - Luz Calvo\n",
      " - James A. Dewar\n",
      " - N.F. Houck\n",
      " - Tina Traverse\n",
      " - Cressida Cowell\n",
      " - James Baldwin\n",
      " - Laini Taylor\n",
      " - Casey Watson\n",
      " - Andrea Gibson\n",
      " - Don Ferguson\n",
      " - Louis de Bernières\n",
      " - Christopher Paolini\n",
      " - James R. White\n",
      " - Steven Cross\n",
      " - Svetlana Chmakova\n",
      " - Mark Montgomery\n",
      " - Steven Strasnick\n",
      " - Janet Ahlberg\n",
      " - Fyodor Dostoyevsky\n",
      " - Nwaocha Ogechukwu\n",
      " - Cindy Brandner\n",
      " - Robert New\n",
      " - Tony Robinson\n",
      " - Miguel Ruiz\n",
      " - Anne Elisabeth Stengl\n",
      " - James Flora\n",
      " - Robert Muller\n",
      " - Barry Jordan Jr.\n",
      " - Graham Chapman\n",
      " - Onjali Q. Raúf\n",
      " - Harry Thompson\n",
      " - Corrie ten Boom\n",
      " - ONE\n",
      " - V. Pain\n",
      " - Jonathan Sumption\n",
      " - Dan Abnett\n",
      " - Danielle Simmons\n",
      " - Shannon Hale\n",
      " - Michael Greger\n",
      " - Terry Pratchett\n",
      " - Michael Eging\n",
      " - Michel Daubert\n",
      " - Serena Anderlini-D'Onofrio\n",
      " - Robert Thier\n",
      " - Marcus Alexander\n",
      " - Shaune Bordere\n",
      " - K'wan\n",
      " - Makoto Yukimura\n",
      " - W. Cleon Skousen\n",
      " - Charlie Higson\n",
      " - Arthur Stanley Gould Lee\n",
      " - Brenda Jackson\n",
      " - Tiffany McDaniel\n",
      " - Erich Maria Remarque\n",
      " - E.K. Weaver\n",
      " - Chuck Black\n",
      " - Paul Twitchell\n",
      " - Yoshiki Nakamura\n",
      " - Dan Gemeinhart\n",
      " - Paul Scott\n",
      " - Sylvia Townsend Warner\n",
      " - Gilbert Hernández\n",
      " - Kimberly Brubaker Bradley\n",
      " - Ralph Moody\n",
      " - Dr. Seuss\n",
      " - Jan Karon\n",
      " - Bob Goff\n",
      " - Douglas Southall Freeman\n",
      " - Cherríe L. Moraga\n",
      " - John Crowder\n",
      " - Yoshihiro Togashi\n",
      " - Dolyn Keys\n",
      " - François Truffaut\n",
      " - Joss Whedon\n",
      " - Dorothy Parker\n",
      " - Ali Vali\n",
      " - Michael Kupperman\n",
      " - Arnold Ytreeide\n",
      " - Arthur W. Pink\n",
      " - NisiOisiN\n",
      " - Kohei Horikoshi\n",
      " - John Flanagan\n",
      " - Angela Y. Davis\n",
      " - Brittany Candau\n",
      " - David Halberstam\n",
      " - Kacen Callender\n",
      " - Ronald Reng\n",
      " - Ibn Arabi\n",
      " - Dan Howell\n",
      " - Harsha Walia\n",
      " - Ellen Levine\n",
      " - Jack Herer\n",
      " - Naoko Takeuchi\n",
      " - Nicole Sager\n",
      " - Pierce Brown\n",
      " - Barbara Decker\n",
      " - Mercedes Lackey\n",
      " - V.E. Schwab\n",
      " - F.C. Yee\n",
      " - Eric Wilson\n",
      " - Natsuki Takaya\n",
      " - Victor Villaseñor\n",
      " - Nalini Singh\n",
      " - Mike Brodie\n",
      " - Chuck Dixon\n",
      " - Teri Woods\n",
      " - Oscar Wilde\n",
      " - Epictetus\n",
      " - Pauline Kael\n",
      " - Martin Heidegger\n",
      " - Zoltan Andrejkovics\n",
      " - Kate Stewart\n",
      " - Jaime Hernández\n",
      " - Larry McMurtry\n",
      " - Stefan Zweig\n",
      " - Suzanne Collins\n",
      " - John Bevere\n",
      " - William Stafford\n",
      " - John Gwynne\n",
      " - Stieg Larsson\n",
      " - Gabor Maté\n",
      " - Meredith T. Taylor\n",
      " - W. Phillip Keller\n",
      " - Donna Cummins\n",
      " - Paul Xavier Jones\n",
      " - Luisa Cogliati Arano\n",
      " - Carter G. Woodson\n",
      " - Alexander Dolgun\n",
      " - James Herriot\n",
      " - Nicholas Wolterstorff\n",
      " - Tracy J. Butler\n",
      " - Akira Toriyama\n",
      " - Charmaine Galloway\n",
      " - Michelle de Kretser\n",
      " - Tom Downey\n",
      " - Phil Knight\n",
      " - Lawrence Anthony\n",
      " - Joe Hill\n",
      " - Nora Roberts\n",
      " - Takehiko Inoue\n",
      " - Patricia C. Wrede\n",
      " - Mike Gunton\n",
      " - Walter Moers\n",
      " - Meera Subramanian\n",
      " - C-Murder\n",
      " - Joyce Meyer\n",
      " - Tite Kubo\n",
      " - Brant Hansen\n",
      " - William Graney\n",
      " - Julia Donaldson\n",
      " - William Joyce\n",
      " - Matthew Desmond\n",
      " - Malcolm X\n",
      " - Paul Stewart\n",
      " - Yuki Midorikawa\n",
      " - William Trevor\n",
      " - Raina Telgemeier\n",
      " - Marin Sorescu\n",
      " - Maurice Walshe\n",
      " - Jess Nevins\n",
      " - John le Carré\n",
      " - Rumi\n",
      " - Sandra Simonds\n",
      " - Didi Menendez\n",
      " - Mike Mignola\n",
      " - Robyn Ellington-Jones\n",
      " - Cinda Williams Chima\n",
      " - Fuyumi Ono\n",
      " - John Boyne\n",
      " - Abigail Roux\n",
      " - Lisa Papp\n",
      " - Hidenori Kusaka\n",
      " - Lashonda Devaughn\n",
      " - Crockett Johnson\n",
      " - Michelle Alexander\n",
      " - Tara Westover\n",
      " - Yushi Nomura\n",
      " - Jimmy Swaggart\n",
      " - Aleksandr Solzhenitsyn\n",
      " - Paul S. Kemp\n",
      " - Aiden Thomas\n",
      " - Nova Weetman\n",
      " - Edward Gorey\n",
      " - Meesha Mink\n",
      " - Diane Duane\n",
      " - Krista Ritchie\n",
      " - Dorothy L. Sayers\n",
      " - Kelley Armstrong\n",
      " - Gregory Boyle\n",
      " - Bessel A. van der Kolk\n",
      " - Yana Toboso\n",
      " - Terryl L. Givens\n",
      " - Andrew Chaikin\n",
      " - Karina Halle\n",
      " - Jonathan Auxier\n",
      " - Laurie Forest\n",
      " - Kris Vallotton\n",
      " - Sister Souljah\n",
      " - Wahida Clark\n",
      " - Winston S. Churchill\n",
      " - June Rae Wood\n",
      " - Sandra Gulland\n",
      " - Samuel Beckett\n",
      " - Eugene H. Peterson\n",
      " - S.E. Hinton\n",
      " - Donald Stratton\n",
      " - Harold Abelson\n",
      " - Lawrence Hill\n",
      " - John Ross\n",
      " - Lin-Manuel Miranda\n",
      " - Eiji Yoshikawa\n",
      " - Jeanette Windle\n",
      " - Becca Fitzpatrick\n",
      " - John Wooden\n",
      " - Gene Luen Yang\n",
      " - Lyn Alexander\n",
      " - Veronica Roth\n",
      " - Harlan Ellison\n",
      " - Dave Roberson\n",
      " - Mark Lewisohn\n",
      " - Theo Richmond\n",
      " - Dean Atta\n"
     ]
    }
   ],
   "source": [
    "show_authors()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Insert Genres"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'14th Century',\n",
       " '16th Century',\n",
       " '18th Century',\n",
       " '19th Century',\n",
       " '1st Grade',\n",
       " '20th Century',\n",
       " '21st Century',\n",
       " '40k',\n",
       " 'Abuse',\n",
       " 'Academic',\n",
       " 'Action',\n",
       " 'Activism',\n",
       " 'Adult',\n",
       " 'Adult Fiction',\n",
       " 'Adventure',\n",
       " 'Aeroplanes',\n",
       " 'Africa',\n",
       " 'African American',\n",
       " 'African American Literature',\n",
       " 'African American Romance',\n",
       " 'Agriculture',\n",
       " 'Alchemy',\n",
       " 'Aliens',\n",
       " 'Alternate History',\n",
       " 'American',\n",
       " 'American Civil War',\n",
       " 'American Fiction',\n",
       " 'American History',\n",
       " 'Americana',\n",
       " 'Ancient',\n",
       " 'Ancient History',\n",
       " 'Angels',\n",
       " 'Animal Fiction',\n",
       " 'Animals',\n",
       " 'Anime',\n",
       " 'Anthologies',\n",
       " 'Anthropology',\n",
       " 'Anthropomorphic',\n",
       " 'Anti Racist',\n",
       " 'Architecture',\n",
       " 'Art',\n",
       " 'Art History',\n",
       " 'Art and Photography',\n",
       " 'Asia',\n",
       " 'Asian Literature',\n",
       " 'Astrology',\n",
       " 'Astronomy',\n",
       " 'Audiobook',\n",
       " 'Australia',\n",
       " 'Autobiography',\n",
       " 'Aviation',\n",
       " 'BDSM',\n",
       " 'Baha I',\n",
       " 'Basketball',\n",
       " 'Batman',\n",
       " 'Biblical',\n",
       " 'Biblical Fiction',\n",
       " 'Biography',\n",
       " 'Biography Memoir',\n",
       " 'Biology',\n",
       " 'Birds',\n",
       " 'Boarding School',\n",
       " 'Book Club',\n",
       " 'Books About Books',\n",
       " 'British Literature',\n",
       " 'Buddhism',\n",
       " 'Buisness',\n",
       " 'Business',\n",
       " 'Canada',\n",
       " 'Cartoon',\n",
       " 'Catholic',\n",
       " 'Cats',\n",
       " 'Chapter Books',\n",
       " 'Chess',\n",
       " 'Chick Lit',\n",
       " 'Childrens',\n",
       " 'Childrens Classics',\n",
       " 'Christian',\n",
       " 'Christian Fantasy',\n",
       " 'Christian Fiction',\n",
       " 'Christian Historical Fiction',\n",
       " 'Christian Living',\n",
       " 'Christian Non Fiction',\n",
       " 'Christian Romance',\n",
       " 'Christianity',\n",
       " 'Christmas',\n",
       " 'Church',\n",
       " 'Church History',\n",
       " 'Cinderella',\n",
       " 'Civil War',\n",
       " 'Civil War History',\n",
       " 'Classic Literature',\n",
       " 'Classics',\n",
       " 'Clean Romance',\n",
       " 'Climate Change Fiction',\n",
       " 'Coding',\n",
       " 'Collections',\n",
       " 'College',\n",
       " 'Colouring Books',\n",
       " 'Comedy',\n",
       " 'Comic Book',\n",
       " 'Comic Strips',\n",
       " 'Comics',\n",
       " 'Comics Manga',\n",
       " 'Coming Of Age',\n",
       " 'Comix',\n",
       " 'Computer Science',\n",
       " 'Computers',\n",
       " 'Conspiracy Theories',\n",
       " 'Contemporary',\n",
       " 'Contemporary Romance',\n",
       " 'Cookbooks',\n",
       " 'Cooking',\n",
       " 'Counselling',\n",
       " 'Cozy Mystery',\n",
       " 'Crafts',\n",
       " 'Crime',\n",
       " 'Criticism',\n",
       " 'Cultural',\n",
       " 'Cyberpunk',\n",
       " 'Czech Literature',\n",
       " 'Dark',\n",
       " 'Dark Fantasy',\n",
       " 'Dc Comics',\n",
       " 'Death',\n",
       " 'Demons',\n",
       " 'Design',\n",
       " 'Detective',\n",
       " 'Dictionaries',\n",
       " 'Diets',\n",
       " 'Dinosaurs',\n",
       " 'Disability',\n",
       " 'Divination',\n",
       " 'Doctor Who',\n",
       " 'Dogs',\n",
       " 'Dragons',\n",
       " 'Drama',\n",
       " 'Dungeons and Dragons',\n",
       " 'Dystopia',\n",
       " 'Eastern Philosophy',\n",
       " 'Ecology',\n",
       " 'Economics',\n",
       " 'Education',\n",
       " 'Elves',\n",
       " 'English Literature',\n",
       " 'Entrepreneurship',\n",
       " 'Environment',\n",
       " 'Epic',\n",
       " 'Epic Fantasy',\n",
       " 'Erotic Paranormal Romance',\n",
       " 'Erotic Romance',\n",
       " 'Erotica',\n",
       " 'Esoterica',\n",
       " 'Espionage',\n",
       " 'Essays',\n",
       " 'European History',\n",
       " 'Evolution',\n",
       " 'Fae',\n",
       " 'Fairies',\n",
       " 'Fairy Tale Retellings',\n",
       " 'Fairy Tales',\n",
       " 'Faith',\n",
       " 'Family',\n",
       " 'Fandom',\n",
       " 'Fantasy',\n",
       " 'Fantasy Romance',\n",
       " 'Fashion',\n",
       " 'Feminism',\n",
       " 'Fiction',\n",
       " 'Field Guides',\n",
       " 'Film',\n",
       " 'Finance',\n",
       " 'Fire Services',\n",
       " 'Folk Tales',\n",
       " 'Folklore',\n",
       " 'Food',\n",
       " 'Food and Drink',\n",
       " 'Football',\n",
       " 'Forgotten Realms',\n",
       " 'Fostering',\n",
       " 'France',\n",
       " 'French Literature',\n",
       " 'Futuristic',\n",
       " 'Games',\n",
       " 'Gaming',\n",
       " 'Gardening',\n",
       " 'Gay',\n",
       " 'Gender',\n",
       " 'Gender Studies',\n",
       " 'Geography',\n",
       " 'German Literature',\n",
       " 'Germany',\n",
       " 'Ghosts',\n",
       " 'God',\n",
       " 'Gothic',\n",
       " 'Graphic Novels',\n",
       " 'Graphic Novels Comics',\n",
       " 'Graphic Novels Manga',\n",
       " 'Greece',\n",
       " 'Greek Mythology',\n",
       " 'Growth Mindset',\n",
       " 'Guides',\n",
       " 'Halloween',\n",
       " 'Harlequin',\n",
       " 'Health',\n",
       " 'Herbs',\n",
       " 'High Fantasy',\n",
       " 'Hinduism',\n",
       " 'Historical',\n",
       " 'Historical Fantasy',\n",
       " 'Historical Fiction',\n",
       " 'Historical Romance',\n",
       " 'History',\n",
       " 'Holiday',\n",
       " 'Holocaust',\n",
       " 'Horror',\n",
       " 'Horses',\n",
       " 'Horticulture',\n",
       " 'How To',\n",
       " 'Humor',\n",
       " 'India',\n",
       " 'Indian Literature',\n",
       " 'Indonesian Literature',\n",
       " 'Inspirational',\n",
       " 'International',\n",
       " 'Interracial Romance',\n",
       " 'Iran',\n",
       " 'Ireland',\n",
       " 'Irish Literature',\n",
       " 'Islam',\n",
       " 'Italian Literature',\n",
       " 'Japan',\n",
       " 'Japanese Literature',\n",
       " 'Jewish',\n",
       " 'Journalism',\n",
       " 'Judaism',\n",
       " 'Juvenile',\n",
       " 'Kids',\n",
       " 'Komik',\n",
       " 'LGBT',\n",
       " 'Language',\n",
       " 'Latin American',\n",
       " 'Latin American History',\n",
       " 'Latin American Literature',\n",
       " 'Law',\n",
       " 'Lds',\n",
       " 'Lds Fiction',\n",
       " 'Lds Non Fiction',\n",
       " 'Leadership',\n",
       " 'Lesbian',\n",
       " 'Lesbian Fiction',\n",
       " 'Lesbian Romance',\n",
       " 'Light Novel',\n",
       " 'Linguistics',\n",
       " 'Literary Criticism',\n",
       " 'Literary Fiction',\n",
       " 'Literature',\n",
       " 'Logic',\n",
       " 'Love',\n",
       " 'M F Romance',\n",
       " 'M M Romance',\n",
       " 'Magic',\n",
       " 'Magical Realism',\n",
       " 'Magick',\n",
       " 'Management',\n",
       " 'Manga',\n",
       " 'Maritime',\n",
       " 'Marriage',\n",
       " 'Martial Arts',\n",
       " 'Marvel',\n",
       " 'Mathematics',\n",
       " 'Media Tie In',\n",
       " 'Medical',\n",
       " 'Medicine',\n",
       " 'Medieval',\n",
       " 'Medieval History',\n",
       " 'Memoir',\n",
       " 'Mental Health',\n",
       " 'Mental Illness',\n",
       " 'Metaphysics',\n",
       " 'Middle Grade',\n",
       " 'Military Fiction',\n",
       " 'Military History',\n",
       " 'Military Romance',\n",
       " 'Military Science Fiction',\n",
       " 'Modern',\n",
       " 'Money',\n",
       " 'Monsters',\n",
       " 'Mormonism',\n",
       " 'Multicultural Literature',\n",
       " 'Murder Mystery',\n",
       " 'Music',\n",
       " 'Musicians',\n",
       " 'Mystery',\n",
       " 'Mystery Thriller',\n",
       " 'Mysticism',\n",
       " 'Mythology',\n",
       " 'Nature',\n",
       " 'Naval History',\n",
       " 'New Adult',\n",
       " 'New Adult Romance',\n",
       " 'New Testament',\n",
       " 'New York',\n",
       " 'Nobel Prize',\n",
       " 'Nonfiction',\n",
       " 'Novella',\n",
       " 'Novels',\n",
       " 'Nutrition',\n",
       " 'Occult',\n",
       " 'Old Testament',\n",
       " 'Ornithology',\n",
       " 'Outdoors',\n",
       " 'Own',\n",
       " 'Palaeontology',\n",
       " 'Paranormal',\n",
       " 'Paranormal Romance',\n",
       " 'Parenting',\n",
       " 'Personal Development',\n",
       " 'Personal Finance',\n",
       " 'Philosophy',\n",
       " 'Photography',\n",
       " 'Physics',\n",
       " 'Picture Books',\n",
       " 'Plants',\n",
       " 'Plays',\n",
       " 'Poetry',\n",
       " 'Poetry Plays',\n",
       " 'Poland',\n",
       " 'Politics',\n",
       " 'Pop Culture',\n",
       " 'Popular Science',\n",
       " 'Portugal',\n",
       " 'Portuguese Literature',\n",
       " 'Post Apocalyptic',\n",
       " 'Poverty',\n",
       " 'Prayer',\n",
       " 'Princesses',\n",
       " 'Programming',\n",
       " 'Psychoanalysis',\n",
       " 'Psychology',\n",
       " 'Queer',\n",
       " 'Race',\n",
       " 'Read For School',\n",
       " 'Realistic Fiction',\n",
       " 'Reference',\n",
       " 'Regency',\n",
       " 'Relationships',\n",
       " 'Religion',\n",
       " 'Research',\n",
       " 'Retellings',\n",
       " 'Rock N Roll',\n",
       " 'Roman',\n",
       " 'Romance',\n",
       " 'Romanian Literature',\n",
       " 'Romantic',\n",
       " 'Romantic Suspense',\n",
       " 'Russia',\n",
       " 'Russian Literature',\n",
       " 'Scandinavian Literature',\n",
       " 'School',\n",
       " 'Science',\n",
       " 'Science Fiction',\n",
       " 'Science Fiction Fantasy',\n",
       " 'Science Fiction Romance',\n",
       " 'Scotland',\n",
       " 'Scripture',\n",
       " 'Seinen',\n",
       " 'Self Help',\n",
       " 'Sequential Art',\n",
       " 'Serbian Literature',\n",
       " 'Shapeshifters',\n",
       " 'Shojo',\n",
       " 'Shonen',\n",
       " 'Short Stories',\n",
       " 'Short Story Collection',\n",
       " 'Slice Of Life',\n",
       " 'Soccer',\n",
       " 'Social Issues',\n",
       " 'Social Justice',\n",
       " 'Social Work',\n",
       " 'Society',\n",
       " 'Sociology',\n",
       " 'Software',\n",
       " 'South Africa',\n",
       " 'Southern',\n",
       " 'Southern Gothic',\n",
       " 'Soviet Union',\n",
       " 'Space',\n",
       " 'Space Opera',\n",
       " 'Spanish History',\n",
       " 'Spanish Literature',\n",
       " 'Speculative Fiction',\n",
       " 'Spirituality',\n",
       " 'Sports',\n",
       " 'Spy Thriller',\n",
       " 'Steampunk',\n",
       " 'Storytime',\n",
       " 'Students',\n",
       " 'Superheroes',\n",
       " 'Supernatural',\n",
       " 'Survival',\n",
       " 'Suspense',\n",
       " 'Sustainability',\n",
       " 'Sweden',\n",
       " 'Sword and Sorcery',\n",
       " 'Tarot',\n",
       " 'Teachers',\n",
       " 'Teaching',\n",
       " 'Technical',\n",
       " 'Technology',\n",
       " 'Teen',\n",
       " 'Textbooks',\n",
       " 'The United States Of America',\n",
       " 'Theatre',\n",
       " 'Theology',\n",
       " 'Theory',\n",
       " 'Thriller',\n",
       " 'Time Travel',\n",
       " 'Tragedy',\n",
       " 'Transgender',\n",
       " 'Travel',\n",
       " 'True Crime',\n",
       " 'True Story',\n",
       " 'Turkish',\n",
       " 'Turkish Literature',\n",
       " 'Tv',\n",
       " 'Unfinished',\n",
       " 'Urban',\n",
       " 'Urban Fantasy',\n",
       " 'Vampires',\n",
       " 'Vegan',\n",
       " 'Victorian',\n",
       " 'Video Games',\n",
       " 'War',\n",
       " 'Webcomic',\n",
       " 'Werewolves',\n",
       " 'Westerns',\n",
       " 'Wildlife',\n",
       " 'Witchcraft',\n",
       " 'Witches',\n",
       " 'Wizards',\n",
       " 'Wolves',\n",
       " 'Womens',\n",
       " 'World History',\n",
       " 'World War I',\n",
       " 'World War II',\n",
       " 'Writing',\n",
       " 'X Men',\n",
       " 'Young Adult',\n",
       " 'Young Adult Contemporary',\n",
       " 'Young Adult Fantasy',\n",
       " 'Young Adult Romance',\n",
       " 'Young Adult Science Fiction',\n",
       " 'Young Readers',\n",
       " 'Zen',\n",
       " 'Zombies'}"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "set_of_genres = set()\n",
    "for genres in dataset['genres'].values:\n",
    "  for genre in genres:\n",
    "    set_of_genres.add(genre)\n",
    "set_of_genres"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "456"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(set_of_genres)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [],
   "source": [
    "for genre in set_of_genres:\n",
    "  insert_genre(genre)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Generos:\n",
      " - Biography\n",
      " - Food and Drink\n",
      " - Greek Mythology\n",
      " - Ancient History\n",
      " - Colouring Books\n",
      " - Shapeshifters\n",
      " - Asia\n",
      " - Cyberpunk\n",
      " - Software\n",
      " - Spirituality\n",
      " - Literary Criticism\n",
      " - Esoterica\n",
      " - Monsters\n",
      " - Birds\n",
      " - Literature\n",
      " - Lesbian Romance\n",
      " - Diets\n",
      " - Transgender\n",
      " - Soccer\n",
      " - Field Guides\n",
      " - Science Fiction Fantasy\n",
      " - Dictionaries\n",
      " - Fairy Tales\n",
      " - Christianity\n",
      " - Cookbooks\n",
      " - Nutrition\n",
      " - Space Opera\n",
      " - Martial Arts\n",
      " - Anime\n",
      " - Crafts\n",
      " - Eastern Philosophy\n",
      " - Young Adult Fantasy\n",
      " - Health\n",
      " - Social Justice\n",
      " - Cats\n",
      " - Young Adult Contemporary\n",
      " - Queer\n",
      " - African American\n",
      " - Medieval History\n",
      " - Mythology\n",
      " - Indian Literature\n",
      " - Zombies\n",
      " - Nobel Prize\n",
      " - Witchcraft\n",
      " - Technology\n",
      " - France\n",
      " - German Literature\n",
      " - Ornithology\n",
      " - Graphic Novels\n",
      " - Espionage\n",
      " - Mental Illness\n",
      " - European History\n",
      " - War\n",
      " - Teen\n",
      " - Read For School\n",
      " - Gothic\n",
      " - American Fiction\n",
      " - Politics\n",
      " - Japan\n",
      " - Shonen\n",
      " - Linguistics\n",
      " - Family\n",
      " - Society\n",
      " - Sociology\n",
      " - Hinduism\n",
      " - International\n",
      " - Biblical Fiction\n",
      " - Ecology\n",
      " - Poetry Plays\n",
      " - Dark\n",
      " - Mental Health\n",
      " - Interracial Romance\n",
      " - World War II\n",
      " - Gender Studies\n",
      " - M M Romance\n",
      " - Mystery\n",
      " - Sweden\n",
      " - Medicine\n",
      " - Activism\n",
      " - Travel\n",
      " - Futuristic\n",
      " - Dragons\n",
      " - Spanish Literature\n",
      " - Aliens\n",
      " - Judaism\n",
      " - Batman\n",
      " - Astrology\n",
      " - Parenting\n",
      " - Demons\n",
      " - Cozy Mystery\n",
      " - Rock N Roll\n",
      " - Action\n",
      " - Komik\n",
      " - Dc Comics\n",
      " - Outdoors\n",
      " - Graphic Novels Comics\n",
      " - Americana\n",
      " - Fairies\n",
      " - Tarot\n",
      " - Social Work\n",
      " - Scandinavian Literature\n",
      " - Literary Fiction\n",
      " - Mystery Thriller\n",
      " - 20th Century\n",
      " - Russia\n",
      " - Gay\n",
      " - Social Issues\n",
      " - Tragedy\n",
      " - Theory\n",
      " - Survival\n",
      " - Geography\n",
      " - Christian Living\n",
      " - Turkish\n",
      " - Regency\n",
      " - Animal Fiction\n",
      " - Marvel\n",
      " - Occult\n",
      " - Classics\n",
      " - Mysticism\n",
      " - 18th Century\n",
      " - Wildlife\n",
      " - Religion\n",
      " - M F Romance\n",
      " - American Civil War\n",
      " - History\n",
      " - Fantasy Romance\n",
      " - Fire Services\n",
      " - Retellings\n",
      " - Biography Memoir\n",
      " - Lds Non Fiction\n",
      " - Angels\n",
      " - Erotic Romance\n",
      " - Indonesian Literature\n",
      " - Historical Fantasy\n",
      " - Holiday\n",
      " - Gender\n",
      " - Southern Gothic\n",
      " - Paranormal Romance\n",
      " - Adventure\n",
      " - Military Fiction\n",
      " - Classic Literature\n",
      " - X Men\n",
      " - Short Story Collection\n",
      " - Womens\n",
      " - Picture Books\n",
      " - Light Novel\n",
      " - Suspense\n",
      " - Juvenile\n",
      " - Scripture\n",
      " - Romance\n",
      " - Comedy\n",
      " - Race\n",
      " - Church History\n",
      " - Greece\n",
      " - Latin American History\n",
      " - Disability\n",
      " - Superheroes\n",
      " - Serbian Literature\n",
      " - Erotica\n",
      " - Finance\n",
      " - Historical\n",
      " - India\n",
      " - Own\n",
      " - Logic\n",
      " - Photography\n",
      " - Urban\n",
      " - Economics\n",
      " - World History\n",
      " - 21st Century\n",
      " - Relationships\n",
      " - Russian Literature\n",
      " - Abuse\n",
      " - How To\n",
      " - American History\n",
      " - Architecture\n",
      " - Musicians\n",
      " - Autobiography\n",
      " - Love\n",
      " - Cultural\n",
      " - Fae\n",
      " - New Adult\n",
      " - Humor\n",
      " - Alternate History\n",
      " - Psychology\n",
      " - Christian Fiction\n",
      " - New Adult Romance\n",
      " - Marriage\n",
      " - Czech Literature\n",
      " - Books About Books\n",
      " - Military History\n",
      " - Fandom\n",
      " - Journalism\n",
      " - Islam\n",
      " - Academic\n",
      " - Video Games\n",
      " - Epic\n",
      " - Crime\n",
      " - Football\n",
      " - Comix\n",
      " - The United States Of America\n",
      " - Adult\n",
      " - BDSM\n",
      " - Wolves\n",
      " - Science\n",
      " - Comic Book\n",
      " - Medical\n",
      " - Epic Fantasy\n",
      " - College\n",
      " - Catholic\n",
      " - Leadership\n",
      " - Princesses\n",
      " - Supernatural\n",
      " - Japanese Literature\n",
      " - Sword and Sorcery\n",
      " - Southern\n",
      " - French Literature\n",
      " - Time Travel\n",
      " - Theology\n",
      " - Lesbian Fiction\n",
      " - Romantic Suspense\n",
      " - Zen\n",
      " - Murder Mystery\n",
      " - Shojo\n",
      " - Fairy Tale Retellings\n",
      " - Old Testament\n",
      " - Germany\n",
      " - Psychoanalysis\n",
      " - Ancient\n",
      " - Popular Science\n",
      " - Book Club\n",
      " - Aeroplanes\n",
      " - Horror\n",
      " - Vampires\n",
      " - Herbs\n",
      " - Buddhism\n",
      " - Textbooks\n",
      " - Iran\n",
      " - Metaphysics\n",
      " - Childrens\n",
      " - Theatre\n",
      " - Ireland\n",
      " - Music\n",
      " - Magical Realism\n",
      " - Astronomy\n",
      " - Inspirational\n",
      " - New Testament\n",
      " - Church\n",
      " - Werewolves\n",
      " - South Africa\n",
      " - Military Romance\n",
      " - Biblical\n",
      " - Chapter Books\n",
      " - Philosophy\n",
      " - Erotic Paranormal Romance\n",
      " - Boarding School\n",
      " - Counselling\n",
      " - True Story\n",
      " - Gaming\n",
      " - World War I\n",
      " - Gardening\n",
      " - Sequential Art\n",
      " - Pop Culture\n",
      " - Death\n",
      " - English Literature\n",
      " - Storytime\n",
      " - Science Fiction Romance\n",
      " - Unfinished\n",
      " - Aviation\n",
      " - Dungeons and Dragons\n",
      " - Comic Strips\n",
      " - Roman\n",
      " - Design\n",
      " - Clean Romance\n",
      " - Cinderella\n",
      " - Ghosts\n",
      " - Anti Racist\n",
      " - Nonfiction\n",
      " - Magic\n",
      " - Dogs\n",
      " - Anthropology\n",
      " - Detective\n",
      " - Students\n",
      " - Education\n",
      " - Alchemy\n",
      " - Steampunk\n",
      " - Personal Finance\n",
      " - Romanian Literature\n",
      " - Middle Grade\n",
      " - Spanish History\n",
      " - Tv\n",
      " - Italian Literature\n",
      " - Faith\n",
      " - Medieval\n",
      " - Historical Fiction\n",
      " - Science Fiction\n",
      " - Holocaust\n",
      " - Criticism\n",
      " - Computers\n",
      " - Turkish Literature\n",
      " - Animals\n",
      " - True Crime\n",
      " - Fostering\n",
      " - Jewish\n",
      " - Witches\n",
      " - Games\n",
      " - Graphic Novels Manga\n",
      " - Contemporary Romance\n",
      " - Scotland\n",
      " - 40k\n",
      " - Sustainability\n",
      " - 1st Grade\n",
      " - Business\n",
      " - Maritime\n",
      " - Fiction\n",
      " - Short Stories\n",
      " - American\n",
      " - Portugal\n",
      " - Halloween\n",
      " - Reference\n",
      " - Buisness\n",
      " - African American Romance\n",
      " - Poetry\n",
      " - Childrens Classics\n",
      " - Writing\n",
      " - Essays\n",
      " - Latin American Literature\n",
      " - Guides\n",
      " - Food\n",
      " - Basketball\n",
      " - Baha I\n",
      " - Latin American\n",
      " - Multicultural Literature\n",
      " - Soviet Union\n",
      " - Christian\n",
      " - Anthropomorphic\n",
      " - Historical Romance\n",
      " - Entrepreneurship\n",
      " - Spy Thriller\n",
      " - Film\n",
      " - Victorian\n",
      " - Modern\n",
      " - Conspiracy Theories\n",
      " - Magick\n",
      " - 16th Century\n",
      " - Nature\n",
      " - Seinen\n",
      " - Cartoon\n",
      " - School\n",
      " - Media Tie In\n",
      " - Feminism\n",
      " - Research\n",
      " - Growth Mindset\n",
      " - Physics\n",
      " - New York\n",
      " - Adult Fiction\n",
      " - Agriculture\n",
      " - Memoir\n",
      " - Palaeontology\n",
      " - Money\n",
      " - Cooking\n",
      " - Comics\n",
      " - Mormonism\n",
      " - Doctor Who\n",
      " - Christian Romance\n",
      " - Post Apocalyptic\n",
      " - Dinosaurs\n",
      " - Fashion\n",
      " - British Literature\n",
      " - Young Readers\n",
      " - Language\n",
      " - Civil War\n",
      " - Christian Non Fiction\n",
      " - Westerns\n",
      " - Art History\n",
      " - Forgotten Realms\n",
      " - Chess\n",
      " - Technical\n",
      " - Computer Science\n",
      " - African American Literature\n",
      " - Biology\n",
      " - Teaching\n",
      " - Poverty\n",
      " - Harlequin\n",
      " - Poland\n",
      " - Young Adult\n",
      " - Art\n",
      " - Young Adult Science Fiction\n",
      " - Irish Literature\n",
      " - Contemporary\n",
      " - Portuguese Literature\n",
      " - Chick Lit\n",
      " - Horses\n",
      " - Christmas\n",
      " - Paranormal\n",
      " - Audiobook\n",
      " - Plays\n",
      " - Drama\n",
      " - Collections\n",
      " - Art and Photography\n",
      " - Naval History\n",
      " - Thriller\n",
      " - Evolution\n",
      " - Coding\n",
      " - Africa\n",
      " - Speculative Fiction\n",
      " - Mathematics\n",
      " - Folk Tales\n",
      " - Law\n",
      " - Civil War History\n",
      " - Webcomic\n",
      " - Horticulture\n",
      " - Plants\n",
      " - Military Science Fiction\n",
      " - Coming Of Age\n",
      " - Management\n",
      " - LGBT\n",
      " - Lds\n",
      " - 14th Century\n",
      " - Canada\n",
      " - Asian Literature\n",
      " - Elves\n",
      " - Teachers\n",
      " - Lesbian\n",
      " - 19th Century\n",
      " - Personal Development\n",
      " - Sports\n",
      " - Space\n",
      " - Self Help\n",
      " - Novella\n",
      " - Prayer\n",
      " - Divination\n",
      " - Australia\n",
      " - Programming\n",
      " - Environment\n",
      " - Urban Fantasy\n",
      " - Christian Historical Fiction\n",
      " - Climate Change Fiction\n",
      " - Lds Fiction\n",
      " - Romantic\n",
      " - Young Adult Romance\n",
      " - Slice Of Life\n",
      " - Manga\n",
      " - Comics Manga\n",
      " - Fantasy\n",
      " - Dystopia\n",
      " - Vegan\n",
      " - Folklore\n",
      " - God\n",
      " - Realistic Fiction\n",
      " - Anthologies\n",
      " - Wizards\n",
      " - Christian Fantasy\n",
      " - Novels\n",
      " - High Fantasy\n",
      " - Dark Fantasy\n",
      " - Kids\n"
     ]
    }
   ],
   "source": [
    "show_genres()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Insert books"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "insert_books(dataset)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['Efrén Divided - Ernesto Cisneros',\n",
       " 'Astonishing X-Men Omnibus - Joss Whedon',\n",
       " \"The Mountain's Morning Song - William Graney\",\n",
       " 'Lackadaisy: Volume #1 - Tracy J. Butler',\n",
       " 'Berserk, Vol. 22 - Kentaro Miura']"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "books = get_random_books(5)\n",
    "[f\"{b[\"title\"]} - {b[\"author\"]}\" for b in books]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Friend relationship"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "execution_count": 48,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "user1 = \"Daniel\"\n",
    "user2 = \"Victor\"\n",
    "make_relation(user1, \"User\", user2, \"User\", \"FRIEND\")\n",
    "make_relation(user2, \"User\", user1, \"User\", \"FRIEND\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Vinculos:\n",
      " - Daniel es amigo de Victor\n",
      " - Fernando es amigo de Victor\n",
      " - Badre es amigo de Victor\n",
      " - Manuel es amigo de Victor\n",
      " - Angel es amigo de Victor\n",
      " - Adrian es amigo de Badre\n",
      " - Victor es amigo de Badre\n",
      " - Victor es amigo de Daniel\n",
      " - Badre es amigo de Adrian\n",
      " - Manuel es amigo de Adrian\n",
      " - Felix es amigo de Adrian\n",
      " - Adrian es amigo de Manuel\n",
      " - Victor es amigo de Manuel\n",
      " - Victor es amigo de Angel\n",
      " - Adrian es amigo de Felix\n",
      " - Fernando es amigo de Felix\n",
      " - Felix es amigo de Fernando\n",
      " - Victor es amigo de Fernando\n"
     ]
    }
   ],
   "source": [
    "# Mostrar vinculos\n",
    "print(\"\\nVinculos:\")\n",
    "result = session.run(\"MATCH (u:User)-[r:FRIEND]->(u2:User) RETURN u.name AS name, u2.name AS name2\")\n",
    "for record in result:\n",
    "  print(f\" - {record['name']} es amigo de {record['name2']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Genre relationship"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "C:\\Users\\victo\\AppData\\Local\\Temp\\ipykernel_31588\\914019553.py:3: DeprecationWarning: write_transaction has been renamed to execute_write\n",
      "  session.write_transaction(book_genre_relationship, book_title, genres)\n"
     ]
    }
   ],
   "source": [
    "for _, row in dataset.iterrows():\n",
    "  book_title, genres = row[\"title\"], row[\"genres\"]\n",
    "  session.write_transaction(book_genre_relationship, book_title, genres)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Vinculos:\n"
     ]
    }
   ],
   "source": [
    "print(\"\\nVinculos:\")\n",
    "result = session.run(\"MATCH (b:Book)-[r:BELONG_TO]->(g:Genre) RETURN b.title AS title, g.name AS name\")\n",
    "for record in result:\n",
    "  print(f\" - {record['title']} pertenece a {record['name']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Close Connection"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [],
   "source": [
    "# session.close()\n",
    "# driver.close()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
