{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 45,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "import pandas as pd"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "metadata": {},
   "outputs": [],
   "source": [
    "pd.set_option('display.max_rows', 5)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "metadata": {},
   "outputs": [],
   "source": [
    "URI = \"neo4j://localhost:7999\"\n",
    "AUTH = (\"neo4j\", \"password\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>title</th>\n",
       "      <th>series</th>\n",
       "      <th>author</th>\n",
       "      <th>genres</th>\n",
       "      <th>pages</th>\n",
       "      <th>publishDate</th>\n",
       "      <th>publishYear</th>\n",
       "      <th>rating</th>\n",
       "      <th>likedPercent</th>\n",
       "      <th>price</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Manhood Of Humanity - The Science And Art Of H...</td>\n",
       "      <td>standalone</td>\n",
       "      <td>Alfred Korkzybski</td>\n",
       "      <td>['Science']</td>\n",
       "      <td>280</td>\n",
       "      <td>April 4th 2010</td>\n",
       "      <td>2010</td>\n",
       "      <td>5.00</td>\n",
       "      <td>100.0</td>\n",
       "      <td>22.40</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>CIRCUS RIDER</td>\n",
       "      <td>standalone</td>\n",
       "      <td>Peter Breschard</td>\n",
       "      <td>['Historical Fiction']</td>\n",
       "      <td>330</td>\n",
       "      <td>December 15th 2010</td>\n",
       "      <td>2010</td>\n",
       "      <td>5.00</td>\n",
       "      <td>100.0</td>\n",
       "      <td>19.59</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>998</th>\n",
       "      <td>Konin: A Quest</td>\n",
       "      <td>standalone</td>\n",
       "      <td>Theo Richmond</td>\n",
       "      <td>['Holocaust', 'History', 'Nonfiction', 'Jewish...</td>\n",
       "      <td>448</td>\n",
       "      <td>August 29th 1995</td>\n",
       "      <td>1995</td>\n",
       "      <td>4.46</td>\n",
       "      <td>99.0</td>\n",
       "      <td>2.77</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>999</th>\n",
       "      <td>The Black Flamingo</td>\n",
       "      <td>standalone</td>\n",
       "      <td>Dean Atta</td>\n",
       "      <td>['Poetry', 'Young Adult', 'LGBT', 'Contemporar...</td>\n",
       "      <td>360</td>\n",
       "      <td>August 8th 2019</td>\n",
       "      <td>2019</td>\n",
       "      <td>4.46</td>\n",
       "      <td>99.0</td>\n",
       "      <td>12.06</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1000 rows × 10 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                 title      series  \\\n",
       "0    Manhood Of Humanity - The Science And Art Of H...  standalone   \n",
       "1                                         CIRCUS RIDER  standalone   \n",
       "..                                                 ...         ...   \n",
       "998                                     Konin: A Quest  standalone   \n",
       "999                                 The Black Flamingo  standalone   \n",
       "\n",
       "                author                                             genres  \\\n",
       "0    Alfred Korkzybski                                        ['Science']   \n",
       "1      Peter Breschard                             ['Historical Fiction']   \n",
       "..                 ...                                                ...   \n",
       "998      Theo Richmond  ['Holocaust', 'History', 'Nonfiction', 'Jewish...   \n",
       "999          Dean Atta  ['Poetry', 'Young Adult', 'LGBT', 'Contemporar...   \n",
       "\n",
       "     pages         publishDate  publishYear  rating  likedPercent  price  \n",
       "0      280      April 4th 2010         2010    5.00         100.0  22.40  \n",
       "1      330  December 15th 2010         2010    5.00         100.0  19.59  \n",
       "..     ...                 ...          ...     ...           ...    ...  \n",
       "998    448    August 29th 1995         1995    4.46          99.0   2.77  \n",
       "999    360     August 8th 2019         2019    4.46          99.0  12.06  \n",
       "\n",
       "[1000 rows x 10 columns]"
      ]
     },
     "execution_count": 48,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "dataset = pd.read_csv(\"./BestBooksEverClean.csv\")\n",
    "dataset"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### From String list, return the list of genres"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "metadata": {},
   "outputs": [],
   "source": [
    "def genres_to_list(genres: str) -> list:\n",
    "  list_of_genres = genres.removeprefix('[').removesuffix(']').split(', ')\n",
    "  return list(map(lambda s: s[1:][:-1], list_of_genres))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "list"
      ]
     },
     "execution_count": 50,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "dataset[\"genres\"] = dataset[\"genres\"].apply(genres_to_list)\n",
    "type(dataset['genres'].iloc[0])"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Enable Connection"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "metadata": {},
   "outputs": [],
   "source": [
    "driver = GraphDatabase.driver(URI, auth=AUTH)\n",
    "session = driver.session()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 82,
   "metadata": {},
   "outputs": [],
   "source": [
    "def insert_user(name: str) -> bool:\n",
    "  # Insertar usuario\n",
    "  result = session.run(f\"MATCH (u:User) WHERE u.name = $name RETURN u.name as name\", {\"name\": name})\n",
    "  if len(result.data()) == 0:\n",
    "    try:\n",
    "      session.run(\"CREATE (u:User {name: $name})\", {\"name\": name})\n",
    "      return True\n",
    "    except:\n",
    "      pass\n",
    "  return False\n",
    "\n",
    "def show_users():\n",
    "  # Mostrar usuarios\n",
    "  print(\"Usuarios:\")\n",
    "  result = session.run(\"MATCH (u:User) RETURN u.name AS name\")\n",
    "  for record in result:\n",
    "    print(f\" - {record[\"name\"]}\")\n",
    "\n",
    "def show_connections():\n",
    "  # Mostrar vinculos\n",
    "  print(\"\\nVinculos:\")\n",
    "  result = session.run(\"MATCH (u:User)-[r:FRIEND]->(u2:User) RETURN u.name AS name, u2.name AS name2\")\n",
    "  for record in result:\n",
    "    print(f\" - {record['name']} es amigo de {record['name2']}\")\n",
    "\n",
    "def insert_author(author: str) -> bool:\n",
    "  # Insertar autor\n",
    "  result = session.run(\"MATCH (a:Author) WHERE a.name = $name RETURN a.name as name\", {\"name\": author})\n",
    "  if len(result.data()) == 0:\n",
    "    try:\n",
    "      session.run(\"CREATE (a:Author {name: $name})\", {\"name\": author})\n",
    "      return True\n",
    "    except:\n",
    "      pass\n",
    "  return False\n",
    "\n",
    "def show_authors():\n",
    "  # Mostrar autores\n",
    "  print(\"Autores:\")\n",
    "  result = session.run(\"MATCH (a:Author) RETURN a.name AS name\")\n",
    "  for record in result:\n",
    "    print(f\" - {record[\"name\"]}\")\n",
    "\n",
    "def insert_genre(genre: str) -> bool:\n",
    "  # Insertar Genero\n",
    "  result = session.run(\"MATCH (g:Genre) WHERE g.name = $name RETURN g.name as name\", {\"name\": genre})\n",
    "  if len(result.data()) == 0:\n",
    "    try:\n",
    "      session.run(\"CREATE (g:Genre {name: $name})\", {\"name\": genre})\n",
    "      return True\n",
    "    except:\n",
    "      pass\n",
    "  return False\n",
    "\n",
    "def show_genres():\n",
    "  # Mostrar generos\n",
    "  print(\"Generos:\")\n",
    "  result = session.run(\"MATCH (g:Genre) RETURN g.name AS name\")\n",
    "  for record in result:\n",
    "    print(f\" - {record[\"name\"]}\")\n",
    "\n",
    "def insert_books(books: pd.DataFrame) -> bool:\n",
    "  # Insertar libros\n",
    "  query = \"\"\"\n",
    "    UNWIND $books AS book\n",
    "    MERGE (b:Book {title: book.title})\n",
    "    ON CREATE SET b.author = book.author, \n",
    "                  b.pages = book.pages, b.rating = book.rating, b.likedPercent = book.likedPercent, \n",
    "                  b.numRating = book.numRating, b.price = book.price, b.publishDate = book.publishDate, \n",
    "                  b.publishYear = book.publishYear\n",
    "    \"\"\"\n",
    "  \n",
    "  try:\n",
    "    books_dict = books.to_dict('records')\n",
    "    session.run(query, {\"books\": books_dict})\n",
    "    return True\n",
    "  except:\n",
    "    pass\n",
    "  return False\n",
    "\n",
    "def get_random_books(n: int):\n",
    "  query = f\"\"\"\n",
    "    MATCH (b:Book)\n",
    "    RETURN b.title AS title, b.author AS author, b.pages AS pages,\n",
    "           b.rating AS rating, b.likedPercent AS likedPercent, b.numRating AS numRating,\n",
    "           b.price AS price, b.publishDate AS publishDate, b.publishYear AS publishYear\n",
    "    ORDER BY rand()\n",
    "    LIMIT {n}\n",
    "    \"\"\"\n",
    "  result = session.run(query)\n",
    "  books = result.data()\n",
    "  return books\n",
    "\n",
    "def make_relation(a_name: str, a_type: str, b_name: str, b_type: str, relation: str) -> bool:\n",
    "  # Crear una relacion\n",
    "  query = \"MATCH (a:\" + a_type + \" {name: $a_name}),\"\\\n",
    "        +       \"(b:\" + b_type + \" {name: $b_name})\"\\\n",
    "        + \"CREATE (a)-[:\" + relation + \"]->(b)\"\n",
    "  attr = {\n",
    "    \"a_name\": a_name, \n",
    "    \"b_name\": b_name\n",
    "    }\n",
    "  \n",
    "  session.run(query, attr)\n",
    "  # try:\n",
    "  #   return True\n",
    "  # except:\n",
    "  #   pass\n",
    "  # return False"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Insert Users"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 53,
   "metadata": {},
   "outputs": [],
   "source": [
    "users = [\n",
    "  'Victor',\n",
    "  'Badre',\n",
    "  'Daniel',\n",
    "  'Adrian',\n",
    "  'Manuel',\n",
    "  'Angel',\n",
    "  'Felix',\n",
    "  'Fernando'\n",
    "]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "metadata": {},
   "outputs": [],
   "source": [
    "for user in users:\n",
    "  insert_user(user)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 93,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Usuarios:\n",
      " - Victor\n",
      " - Badre\n",
      " - Daniel\n",
      " - Adrian\n",
      " - Manuel\n",
      " - Angel\n",
      " - Felix\n",
      " - Fernando\n"
     ]
    }
   ],
   "source": [
    "show_users()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Insert authors"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 56,
   "metadata": {},
   "outputs": [],
   "source": [
    "for author in dataset['author'].unique():\n",
    "  insert_author(author)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Autores:\n",
      " - Alfred Korkzybski\n",
      " - Peter Breschard\n",
      " - Ocelot Emerson\n",
      " - Tina M. Randolph\n",
      " - Richard Atwood\n",
      " - Jerry Seguin\n",
      " - Violet's Vegan Comics\n",
      " - Ki Longfellow\n",
      " - Ruth Watson-Morris\n",
      " - Steve Julien\n",
      " - Ali Marsman\n",
      " - Hudith F. Dolkart\n",
      " - Brae Wyckoff\n",
      " - Sita Bennett\n",
      " - Jacob Lasher\n",
      " - Bernie Morris\n",
      " - Rohith S. Katbamna\n",
      " - Martha A. Cheves\n",
      " - Jo-Anne McArthur\n",
      " - Bill Watterson\n",
      " - Francis Shenstone\n",
      " - J.D. Estrada\n",
      " - Aimee Lewis\n",
      " - Brandon Sanderson\n",
      " - William Shakespeare\n",
      " - Victoria Botkin\n",
      " - Anonymous\n",
      " - Rachna Khemchandani\n",
      " - Janet G. Travell\n",
      " - Pythia Peay\n",
      " - Banani Ray\n",
      " - J.K. Rowling\n",
      " - Laurick Ingram\n",
      " - G.B. Hope\n",
      " - George Herriman\n",
      " - George Mendoza\n",
      " - Lawrence Hole\n",
      " - Francine Rivers\n",
      " - Neil Gaiman\n",
      " - Fletcher McHale\n",
      " - Marika Germanis\n",
      " - Amit Ray\n",
      " - Georg Trakl\n",
      " - Andrew Peterson\n",
      " - Rich Okun\n",
      " - S.F. Mazhar\n",
      " - Gary Collins\n",
      " - Rien Poortvliet\n",
      " - Nick Brandt\n",
      " - Sue Lloyd-Roberts\n",
      " - Teric Darken\n",
      " - Sarah J. Maas\n",
      " - Michelle R. Eastman\n",
      " - Karen Kingsbury\n",
      " - Amanda Barratt\n",
      " - Lisa McMann\n",
      " - John Williams\n",
      " - The Church of Jesus Christ of Latter-day Saints\n",
      " - John Andrew Simpson\n",
      " - Colleen Thatcher\n",
      " - Julie Morgan\n",
      " - Phil Hardy\n",
      " - Bhikkhu Bodhi\n",
      " - Richard Fenton\n",
      " - John Fitzgerald\n",
      " - Phil Hunt\n",
      " - Renée Paule\n",
      " - Anna Othitis\n",
      " - Bryon MacWilliams\n",
      " - Ringo Gene Hayden\n",
      " - Joe Connolly\n",
      " - Marissa Meyer\n",
      " - Hugh Behm-Steinberg\n",
      " - Robin Stevens\n",
      " - Erin Hunter\n",
      " - Mark Crilley\n",
      " - Patrick O'Brian\n",
      " - Bahá'u'lláh\n",
      " - Pamela Kribbe\n",
      " - Idries Shah\n",
      " - Dorothy Dunnett\n",
      " - Martin Luther King Jr.\n",
      " - Shinry\n",
      " - Tamera Alexander\n",
      " - Ngaire Elder\n",
      " - Hayao Miyazaki\n",
      " - Eiichiro Oda\n",
      " - Alex Hirsch\n",
      " - Henri Cartier-Bresson\n",
      " - J.R. Ward\n",
      " - Lucy Score\n",
      " - Gary Larson\n",
      " - Alessandro Boccaletti\n",
      " - Annette Marie\n",
      " - Ann Joslin Williams\n",
      " - Michael Rickard\n",
      " - Frank Stanford\n",
      " - Don Rosa\n",
      " - Jeff W. Horton\n",
      " - Deja King\n",
      " - Frances J. Roberts\n",
      " - Andrew Hussie\n",
      " - Joss Stirling\n",
      " - Jean Noli\n",
      " - Tony Cartalucci\n",
      " - Jane Bettany\n",
      " - Bruce Robinson\n",
      " - Ward Foley\n",
      " - David Allen Sibley\n",
      " - David Vance\n",
      " - Harold Klemp\n",
      " - Jackie Wang\n",
      " - Robin Jones Gunn\n",
      " - Joseph Stroud\n",
      " - Rich Mullins\n",
      " - Doris Burn\n",
      " - Hiroshi Sugimoto\n",
      " - Michael D. O'Brien\n",
      " - One Direction\n",
      " - Michelle Paver\n",
      " - Swami Venkatesananda\n",
      " - Ellen G. White\n",
      " - Roald Dahl\n",
      " - Ashley Antoinette\n",
      " - Joseph L. Henderson\n",
      " - Radhanath Swami\n",
      " - Robert Kirkman\n",
      " - Alexei Maxim Russell\n",
      " - Kentaro Miura\n",
      " - Daniel Pinkwater\n",
      " - Helen Roseveare\n",
      " - Maya Angelou\n",
      " - Michael Dante DiMartino\n",
      " - Robin Hobb\n",
      " - Jill Barklem\n",
      " - Courtney Maum\n",
      " - Sarah Moon\n",
      " - Alice Oseman\n",
      " - Mark Mabry\n",
      " - Stephen Skinner\n",
      " - Iris Muller-Westermann\n",
      " - Hafez\n",
      " - Lynette Noni\n",
      " - Alisa Kwitney\n",
      " - George R.R. Martin\n",
      " - Carole Devine\n",
      " - Jennifer L. Armentrout\n",
      " - Gleb Tsipursky\n",
      " - Dave Jacke\n",
      " - James Thurber\n",
      " - Gordon B. Hinckley\n",
      " - Rick Renner\n",
      " - Karen M. Fjeldheim\n",
      " - Tui T. Sutherland\n",
      " - Tom DeLonge\n",
      " - David A. Bednar\n",
      " - Derek Landy\n",
      " - Anthony Ray Hinton\n",
      " - Herbert Coleridge\n",
      " - Gordy Marshall\n",
      " - Joyce Mitchell\n",
      " - Maria Johnsen\n",
      " - Andrew C. Skinner\n",
      " - James E. Talmage\n",
      " - Alice O. Howell\n",
      " - Muhammad Bin Jamil Zeno\n",
      " - Angela Dolbear\n",
      " - Rainer Maria Rilke\n",
      " - S.D. Smith\n",
      " - Jean Baptiste Saint-Jure\n",
      " - Dave Hunt\n",
      " - D. Martyn Lloyd-Jones\n",
      " - Richelle Mead\n",
      " - Jim Butcher\n",
      " - Charles M. Schulz\n",
      " - Hiromu Arakawa\n",
      " - Odysseus Elytis\n",
      " - Andrew Williamson\n",
      " - Laura Sobiech\n",
      " - David Benioff\n",
      " - Robert Jordan\n",
      " - Shannon Messenger\n",
      " - Masatoshi Kusakabe\n",
      " - Richard P. Feynman\n",
      " - Celia Hawkesworth\n",
      " - Abu Hamid al-Ghazali\n",
      " - Marilyn Boyer\n",
      " - Mary Oliver\n",
      " - Cassandra Clare\n",
      " - Christopher Yost\n",
      " - Michael Phillip Cash\n",
      " - Jessica Shirvington\n",
      " - Kiera Cass\n",
      " - Molly Evangeline\n",
      " - Justin Bieber\n",
      " - J.R.R. Tolkien\n",
      " - Charlie Mackesy\n",
      " - Rebecca Donovan\n",
      " - Bryan Stevenson\n",
      " - Virginia McKevitt\n",
      " - Thomas L. Trevethan\n",
      " - Pope John Paul II\n",
      " - John Rule\n",
      " - Conrad Aiken\n",
      " - Frank Miller\n",
      " - Joseph Smith Jr.\n",
      " - Marie Lu\n",
      " - ابن كثير\n",
      " - T.B. Solangel\n",
      " - Treasure Hernandez\n",
      " - Edward Reese\n",
      " - James Vella-Bardon\n",
      " - Warren Buffett\n",
      " - Raymond Carver\n",
      " - Tamora Pierce\n",
      " - Jennifer Li Shotz\n",
      " - R.A. Salvatore\n",
      " - Rick Riordan\n",
      " - Akala\n",
      " - Patricia Lee Gauch\n",
      " - Taylor Swift\n",
      " - Peggy Bacon\n",
      " - Patricia Briggs\n",
      " - Chris Pérez\n",
      " - Belzebuub\n",
      " - Neal Shusterman\n",
      " - Beth Moore\n",
      " - Cyma Rubin\n",
      " - Maurice Sendak\n",
      " - Nâzım Hikmet Ran\n",
      " - James S.A. Corey\n",
      " - Alla Danishevsky\n",
      " - E.W. Kenyon\n",
      " - Takerra Allen\n",
      " - Jorge Luis Borges\n",
      " - Brandon Mull\n",
      " - James Ponti\n",
      " - Jody Carrington\n",
      " - Brant Pitre\n",
      " - Bob Dylan\n",
      " - Morton Feldman\n",
      " - Hanif Abdurraqib\n",
      " - Konami Sonoda\n",
      " - Tiffany Reisz\n",
      " - Sherrilyn Kenyon\n",
      " - Bruce Lee Bond\n",
      " - Augustine Martin\n",
      " - Nancy Parent\n",
      " - Janie Pendleton\n",
      " - Martin Lings\n",
      " - Trenton Lee Stewart\n",
      " - Wole Akosile\n",
      " - Ilona Andrews\n",
      " - Owen Mullen\n",
      " - Thomas R. Holtz Jr.\n",
      " - Satyajit Ray\n",
      " - Eknath Easwaran\n",
      " - Alexis Pauline Gumbs\n",
      " - Stephen King\n",
      " - Kristin Hannah\n",
      " - Gary Russell\n",
      " - Primo Levi\n",
      " - Fletcher DeLancey\n",
      " - Anne Zoelle\n",
      " - Marcel Proust\n",
      " - Shoghi Effendi\n",
      " - Adèle Geras\n",
      " - Sheri Dew\n",
      " - Maria Faustyna Kowalska\n",
      " - Rebecca Sugar\n",
      " - Chris Colfer\n",
      " - Neal A. Maxwell\n",
      " - Jane Austen\n",
      " - Victor Mollo\n",
      " - Patrick Rothfuss\n",
      " - Ian W. Toll\n",
      " - Jennifer Lynn Alvarez\n",
      " - William H. Brewer\n",
      " - Russell T. Davies\n",
      " - Bruce D. Perry\n",
      " - Ida B. Wells-Barnett\n",
      " - Andrew Murray\n",
      " - Roy Glenn\n",
      " - Pope Paul VI\n",
      " - Bibhutibhushan Bandyopadhyay\n",
      " - Jane Roberts\n",
      " - Kenneth Jarrett Singleton\n",
      " - Kanata Konami\n",
      " - Robin Wall Kimmerer\n",
      " - Dale Pendell\n",
      " - Sangharakshita\n",
      " - Aaron B. Powell\n",
      " - Gerald N. Lund\n",
      " - Maud Hart Lovelace\n",
      " - Eric Blehm\n",
      " - Jaye L. Knight\n",
      " - Douglas Adams\n",
      " - Stephen Moss\n",
      " - Arthur Bennett\n",
      " - ShelFoote\n",
      " - Michael Wood\n",
      " - S.A. Chakraborty\n",
      " - Karen Tyrrell\n",
      " - Victoria Wood\n",
      " - Michael J. Sullivan\n",
      " - Sri Sri Ravi Shankar\n",
      " - Kate Petty\n",
      " - Jenny Twist\n",
      " - Kiyohiko Azuma\n",
      " - Connilyn Cossette\n",
      " - Conrad Richter\n",
      " - Edgar Allan Poe\n",
      " - Charles Haddon Spurgeon\n",
      " - Art Spiegelman\n",
      " - Aristotle\n",
      " - Darlene Deibler Rose\n",
      " - Sharon Lee\n",
      " - Brandon Stanton\n",
      " - Armando Cosani\n",
      " - Susan M. Boyer\n",
      " - Amber Rose\n",
      " - Patricia Polacco\n",
      " - K.C. Lynn\n",
      " - Julie Kagawa\n",
      " - Eduardo Galeano\n",
      " - Heather Brewer\n",
      " - Dave Ramsey\n",
      " - Catherine M. Wilson\n",
      " - Ernest K. Gann\n",
      " - Wendell Berry\n",
      " - Hajime Isayama\n",
      " - Stjepan Šejić\n",
      " - John Lewis\n",
      " - Meša Selimović\n",
      " - A.C. Bhaktivedanta Swami Prabhupāda\n",
      " - Joe Egly\n",
      " - M. Sweeney\n",
      " - Mark McLaughlin\n",
      " - Pénélope Bagieu\n",
      " - Dan Crenshaw\n",
      " - Ted Dekker\n",
      " - Alisa Mullen\n",
      " - Svetlana Amelekhina\n",
      " - Carmen Maria Machado\n",
      " - Audre Lorde\n",
      " - Michael S. Heiser\n",
      " - Peter Menzel\n",
      " - Anton Chekhov\n",
      " - Jay Kristoff\n",
      " - J.D. Robb\n",
      " - John Green\n",
      " - Silvia Federici\n",
      " - Robert L. Millet\n",
      " - William Horwood\n",
      " - Mikhail Tal\n",
      " - Watty Piper\n",
      " - N.T. Wright\n",
      " - Toni Weschler\n",
      " - Laurell K. Hamilton\n",
      " - Brian K. Vaughan\n",
      " - Zia Mahmood\n",
      " - Benedict XVI\n",
      " - Naoki Urasawa\n",
      " - A.A. Milne\n",
      " - Catherine West\n",
      " - Tsugumi Ohba\n",
      " - Javan\n",
      " - Scott Meredith\n",
      " - Wendy Pini\n",
      " - Tara Bennett\n",
      " - Deborah Harkness\n",
      " - Diana Gabaldon\n",
      " - Tim Burton\n",
      " - Svetlana Alexievich\n",
      " - C.G. Jung\n",
      " - Garth Nix\n",
      " - Sheryl Kahn\n",
      " - Amie Kaufman\n",
      " - Kate O'Hearn\n",
      " - Malvina G. Vogel\n",
      " - Cathy Glass\n",
      " - Charles T. Munger\n",
      " - Andrei Tarkovsky\n",
      " - L.J. Smith\n",
      " - John W. Trimmer\n",
      " - Angie Thomas\n",
      " - Carl Barks\n",
      " - Wendy Alec\n",
      " - Agatha Christie\n",
      " - Lois McMaster Bujold\n",
      " - Frank Sheed\n",
      " - Louis de Montfort\n",
      " - Jamie Sams\n",
      " - Jonathan Lynn\n",
      " - Roberto Juarroz\n",
      " - Ernesto Cisneros\n",
      " - Chimamanda Ngozi Adichie\n",
      " - Gavin Aung Than\n",
      " - Holly Jackson\n",
      " - Inbali Iserles\n",
      " - Sapan Saxena\n",
      " - Abolqasem Ferdowsi\n",
      " - Max Lucado\n",
      " - Kate Egan\n",
      " - Jim Beaver\n",
      " - Brian Sibley\n",
      " - Marie-Louise von Franz\n",
      " - Ronie Kendig\n",
      " - Charlie Kaufman\n",
      " - Mihai Eminescu\n",
      " - Phil Vischer\n",
      " - Rachel Caine\n",
      " - Aka Akasaka\n",
      " - Shaun Tan\n",
      " - Jessica Townsend\n",
      " - Smith Wigglesworth\n",
      " - Dario Marianelli\n",
      " - Tracy Brown\n",
      " - Osho\n",
      " - Flannery O'Connor\n",
      " - Meher Baba\n",
      " - Warren Ellis\n",
      " - Valentin Tomberg\n",
      " - Edward L. Kimball\n",
      " - Mark Greaney\n",
      " - Haing Ngor\n",
      " - David Foster Wallace\n",
      " - Henry B. Eyring\n",
      " - Ryōkan\n",
      " - Billy Graham\n",
      " - Arthur Conan Doyle\n",
      " - Jerry Cook\n",
      " - Warren H. Carroll\n",
      " - Fernando Pessoa\n",
      " - Raymond Holliwell\n",
      " - Guy Johnson\n",
      " - Jan Valtin\n",
      " - Kelly Rimmer\n",
      " - George MacDonald\n",
      " - Donalyn Miller\n",
      " - Muna Imady\n",
      " - Sarah Dessen\n",
      " - Westminster Assembly\n",
      " - Simon Marsden\n",
      " - Saiber\n",
      " - Cherise Sinclair\n",
      " - Jun Mochizuki\n",
      " - Katsuhiro Otomo\n",
      " - Jackie Castle\n",
      " - Brandon Thomas DiSabatino\n",
      " - Christopher Ash\n",
      " - Stephen E. Robinson\n",
      " - Henryk Grossmann\n",
      " - Marshal Younger\n",
      " - Rinko Kawauchi\n",
      " - Lian Tanner\n",
      " - Sarah Young\n",
      " - Luz Calvo\n",
      " - James A. Dewar\n",
      " - N.F. Houck\n",
      " - Tina Traverse\n",
      " - Cressida Cowell\n",
      " - James Baldwin\n",
      " - Laini Taylor\n",
      " - Casey Watson\n",
      " - Andrea Gibson\n",
      " - Don Ferguson\n",
      " - Louis de Bernières\n",
      " - Christopher Paolini\n",
      " - James R. White\n",
      " - Steven Cross\n",
      " - Svetlana Chmakova\n",
      " - Mark Montgomery\n",
      " - Steven Strasnick\n",
      " - Janet Ahlberg\n",
      " - Fyodor Dostoyevsky\n",
      " - Nwaocha Ogechukwu\n",
      " - Cindy Brandner\n",
      " - Robert New\n",
      " - Tony Robinson\n",
      " - Miguel Ruiz\n",
      " - Anne Elisabeth Stengl\n",
      " - James Flora\n",
      " - Robert Muller\n",
      " - Barry Jordan Jr.\n",
      " - Graham Chapman\n",
      " - Onjali Q. Raúf\n",
      " - Harry Thompson\n",
      " - Corrie ten Boom\n",
      " - ONE\n",
      " - V. Pain\n",
      " - Jonathan Sumption\n",
      " - Dan Abnett\n",
      " - Danielle Simmons\n",
      " - Shannon Hale\n",
      " - Michael Greger\n",
      " - Terry Pratchett\n",
      " - Michael Eging\n",
      " - Michel Daubert\n",
      " - Serena Anderlini-D'Onofrio\n",
      " - Robert Thier\n",
      " - Marcus Alexander\n",
      " - Shaune Bordere\n",
      " - K'wan\n",
      " - Makoto Yukimura\n",
      " - W. Cleon Skousen\n",
      " - Charlie Higson\n",
      " - Arthur Stanley Gould Lee\n",
      " - Brenda Jackson\n",
      " - Tiffany McDaniel\n",
      " - Erich Maria Remarque\n",
      " - E.K. Weaver\n",
      " - Chuck Black\n",
      " - Paul Twitchell\n",
      " - Yoshiki Nakamura\n",
      " - Dan Gemeinhart\n",
      " - Paul Scott\n",
      " - Sylvia Townsend Warner\n",
      " - Gilbert Hernández\n",
      " - Kimberly Brubaker Bradley\n",
      " - Ralph Moody\n",
      " - Dr. Seuss\n",
      " - Jan Karon\n",
      " - Bob Goff\n",
      " - Douglas Southall Freeman\n",
      " - Cherríe L. Moraga\n",
      " - John Crowder\n",
      " - Yoshihiro Togashi\n",
      " - Dolyn Keys\n",
      " - François Truffaut\n",
      " - Joss Whedon\n",
      " - Dorothy Parker\n",
      " - Ali Vali\n",
      " - Michael Kupperman\n",
      " - Arnold Ytreeide\n",
      " - Arthur W. Pink\n",
      " - NisiOisiN\n",
      " - Kohei Horikoshi\n",
      " - John Flanagan\n",
      " - Angela Y. Davis\n",
      " - Brittany Candau\n",
      " - David Halberstam\n",
      " - Kacen Callender\n",
      " - Ronald Reng\n",
      " - Ibn Arabi\n",
      " - Dan Howell\n",
      " - Harsha Walia\n",
      " - Ellen Levine\n",
      " - Jack Herer\n",
      " - Naoko Takeuchi\n",
      " - Nicole Sager\n",
      " - Pierce Brown\n",
      " - Barbara Decker\n",
      " - Mercedes Lackey\n",
      " - V.E. Schwab\n",
      " - F.C. Yee\n",
      " - Eric Wilson\n",
      " - Natsuki Takaya\n",
      " - Victor Villaseñor\n",
      " - Nalini Singh\n",
      " - Mike Brodie\n",
      " - Chuck Dixon\n",
      " - Teri Woods\n",
      " - Oscar Wilde\n",
      " - Epictetus\n",
      " - Pauline Kael\n",
      " - Martin Heidegger\n",
      " - Zoltan Andrejkovics\n",
      " - Kate Stewart\n",
      " - Jaime Hernández\n",
      " - Larry McMurtry\n",
      " - Stefan Zweig\n",
      " - Suzanne Collins\n",
      " - John Bevere\n",
      " - William Stafford\n",
      " - John Gwynne\n",
      " - Stieg Larsson\n",
      " - Gabor Maté\n",
      " - Meredith T. Taylor\n",
      " - W. Phillip Keller\n",
      " - Donna Cummins\n",
      " - Paul Xavier Jones\n",
      " - Luisa Cogliati Arano\n",
      " - Carter G. Woodson\n",
      " - Alexander Dolgun\n",
      " - James Herriot\n",
      " - Nicholas Wolterstorff\n",
      " - Tracy J. Butler\n",
      " - Akira Toriyama\n",
      " - Charmaine Galloway\n",
      " - Michelle de Kretser\n",
      " - Tom Downey\n",
      " - Phil Knight\n",
      " - Lawrence Anthony\n",
      " - Joe Hill\n",
      " - Nora Roberts\n",
      " - Takehiko Inoue\n",
      " - Patricia C. Wrede\n",
      " - Mike Gunton\n",
      " - Walter Moers\n",
      " - Meera Subramanian\n",
      " - C-Murder\n",
      " - Joyce Meyer\n",
      " - Tite Kubo\n",
      " - Brant Hansen\n",
      " - William Graney\n",
      " - Julia Donaldson\n",
      " - William Joyce\n",
      " - Matthew Desmond\n",
      " - Malcolm X\n",
      " - Paul Stewart\n",
      " - Yuki Midorikawa\n",
      " - William Trevor\n",
      " - Raina Telgemeier\n",
      " - Marin Sorescu\n",
      " - Maurice Walshe\n",
      " - Jess Nevins\n",
      " - John le Carré\n",
      " - Rumi\n",
      " - Sandra Simonds\n",
      " - Didi Menendez\n",
      " - Mike Mignola\n",
      " - Robyn Ellington-Jones\n",
      " - Cinda Williams Chima\n",
      " - Fuyumi Ono\n",
      " - John Boyne\n",
      " - Abigail Roux\n",
      " - Lisa Papp\n",
      " - Hidenori Kusaka\n",
      " - Lashonda Devaughn\n",
      " - Crockett Johnson\n",
      " - Michelle Alexander\n",
      " - Tara Westover\n",
      " - Yushi Nomura\n",
      " - Jimmy Swaggart\n",
      " - Aleksandr Solzhenitsyn\n",
      " - Paul S. Kemp\n",
      " - Aiden Thomas\n",
      " - Nova Weetman\n",
      " - Edward Gorey\n",
      " - Meesha Mink\n",
      " - Diane Duane\n",
      " - Krista Ritchie\n",
      " - Dorothy L. Sayers\n",
      " - Kelley Armstrong\n",
      " - Gregory Boyle\n",
      " - Bessel A. van der Kolk\n",
      " - Yana Toboso\n",
      " - Terryl L. Givens\n",
      " - Andrew Chaikin\n",
      " - Karina Halle\n",
      " - Jonathan Auxier\n",
      " - Laurie Forest\n",
      " - Kris Vallotton\n",
      " - Sister Souljah\n",
      " - Wahida Clark\n",
      " - Winston S. Churchill\n",
      " - June Rae Wood\n",
      " - Sandra Gulland\n",
      " - Samuel Beckett\n",
      " - Eugene H. Peterson\n",
      " - S.E. Hinton\n",
      " - Donald Stratton\n",
      " - Harold Abelson\n",
      " - Lawrence Hill\n",
      " - John Ross\n",
      " - Lin-Manuel Miranda\n",
      " - Eiji Yoshikawa\n",
      " - Jeanette Windle\n",
      " - Becca Fitzpatrick\n",
      " - John Wooden\n",
      " - Gene Luen Yang\n",
      " - Lyn Alexander\n",
      " - Veronica Roth\n",
      " - Harlan Ellison\n",
      " - Dave Roberson\n",
      " - Mark Lewisohn\n",
      " - Theo Richmond\n",
      " - Dean Atta\n"
     ]
    }
   ],
   "source": [
    "show_authors()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Insert Genres"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 58,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'14th Century',\n",
       " '16th Century',\n",
       " '18th Century',\n",
       " '19th Century',\n",
       " '1st Grade',\n",
       " '20th Century',\n",
       " '21st Century',\n",
       " '40k',\n",
       " 'Abuse',\n",
       " 'Academic',\n",
       " 'Action',\n",
       " 'Activism',\n",
       " 'Adult',\n",
       " 'Adult Fiction',\n",
       " 'Adventure',\n",
       " 'Aeroplanes',\n",
       " 'Africa',\n",
       " 'African American',\n",
       " 'African American Literature',\n",
       " 'African American Romance',\n",
       " 'Agriculture',\n",
       " 'Alchemy',\n",
       " 'Aliens',\n",
       " 'Alternate History',\n",
       " 'American',\n",
       " 'American Civil War',\n",
       " 'American Fiction',\n",
       " 'American History',\n",
       " 'Americana',\n",
       " 'Ancient',\n",
       " 'Ancient History',\n",
       " 'Angels',\n",
       " 'Animal Fiction',\n",
       " 'Animals',\n",
       " 'Anime',\n",
       " 'Anthologies',\n",
       " 'Anthropology',\n",
       " 'Anthropomorphic',\n",
       " 'Anti Racist',\n",
       " 'Architecture',\n",
       " 'Art',\n",
       " 'Art History',\n",
       " 'Art and Photography',\n",
       " 'Asia',\n",
       " 'Asian Literature',\n",
       " 'Astrology',\n",
       " 'Astronomy',\n",
       " 'Audiobook',\n",
       " 'Australia',\n",
       " 'Autobiography',\n",
       " 'Aviation',\n",
       " 'BDSM',\n",
       " 'Baha I',\n",
       " 'Basketball',\n",
       " 'Batman',\n",
       " 'Biblical',\n",
       " 'Biblical Fiction',\n",
       " 'Biography',\n",
       " 'Biography Memoir',\n",
       " 'Biology',\n",
       " 'Birds',\n",
       " 'Boarding School',\n",
       " 'Book Club',\n",
       " 'Books About Books',\n",
       " 'British Literature',\n",
       " 'Buddhism',\n",
       " 'Buisness',\n",
       " 'Business',\n",
       " 'Canada',\n",
       " 'Cartoon',\n",
       " 'Catholic',\n",
       " 'Cats',\n",
       " 'Chapter Books',\n",
       " 'Chess',\n",
       " 'Chick Lit',\n",
       " 'Childrens',\n",
       " 'Childrens Classics',\n",
       " 'Christian',\n",
       " 'Christian Fantasy',\n",
       " 'Christian Fiction',\n",
       " 'Christian Historical Fiction',\n",
       " 'Christian Living',\n",
       " 'Christian Non Fiction',\n",
       " 'Christian Romance',\n",
       " 'Christianity',\n",
       " 'Christmas',\n",
       " 'Church',\n",
       " 'Church History',\n",
       " 'Cinderella',\n",
       " 'Civil War',\n",
       " 'Civil War History',\n",
       " 'Classic Literature',\n",
       " 'Classics',\n",
       " 'Clean Romance',\n",
       " 'Climate Change Fiction',\n",
       " 'Coding',\n",
       " 'Collections',\n",
       " 'College',\n",
       " 'Colouring Books',\n",
       " 'Comedy',\n",
       " 'Comic Book',\n",
       " 'Comic Strips',\n",
       " 'Comics',\n",
       " 'Comics Manga',\n",
       " 'Coming Of Age',\n",
       " 'Comix',\n",
       " 'Computer Science',\n",
       " 'Computers',\n",
       " 'Conspiracy Theories',\n",
       " 'Contemporary',\n",
       " 'Contemporary Romance',\n",
       " 'Cookbooks',\n",
       " 'Cooking',\n",
       " 'Counselling',\n",
       " 'Cozy Mystery',\n",
       " 'Crafts',\n",
       " 'Crime',\n",
       " 'Criticism',\n",
       " 'Cultural',\n",
       " 'Cyberpunk',\n",
       " 'Czech Literature',\n",
       " 'Dark',\n",
       " 'Dark Fantasy',\n",
       " 'Dc Comics',\n",
       " 'Death',\n",
       " 'Demons',\n",
       " 'Design',\n",
       " 'Detective',\n",
       " 'Dictionaries',\n",
       " 'Diets',\n",
       " 'Dinosaurs',\n",
       " 'Disability',\n",
       " 'Divination',\n",
       " 'Doctor Who',\n",
       " 'Dogs',\n",
       " 'Dragons',\n",
       " 'Drama',\n",
       " 'Dungeons and Dragons',\n",
       " 'Dystopia',\n",
       " 'Eastern Philosophy',\n",
       " 'Ecology',\n",
       " 'Economics',\n",
       " 'Education',\n",
       " 'Elves',\n",
       " 'English Literature',\n",
       " 'Entrepreneurship',\n",
       " 'Environment',\n",
       " 'Epic',\n",
       " 'Epic Fantasy',\n",
       " 'Erotic Paranormal Romance',\n",
       " 'Erotic Romance',\n",
       " 'Erotica',\n",
       " 'Esoterica',\n",
       " 'Espionage',\n",
       " 'Essays',\n",
       " 'European History',\n",
       " 'Evolution',\n",
       " 'Fae',\n",
       " 'Fairies',\n",
       " 'Fairy Tale Retellings',\n",
       " 'Fairy Tales',\n",
       " 'Faith',\n",
       " 'Family',\n",
       " 'Fandom',\n",
       " 'Fantasy',\n",
       " 'Fantasy Romance',\n",
       " 'Fashion',\n",
       " 'Feminism',\n",
       " 'Fiction',\n",
       " 'Field Guides',\n",
       " 'Film',\n",
       " 'Finance',\n",
       " 'Fire Services',\n",
       " 'Folk Tales',\n",
       " 'Folklore',\n",
       " 'Food',\n",
       " 'Food and Drink',\n",
       " 'Football',\n",
       " 'Forgotten Realms',\n",
       " 'Fostering',\n",
       " 'France',\n",
       " 'French Literature',\n",
       " 'Futuristic',\n",
       " 'Games',\n",
       " 'Gaming',\n",
       " 'Gardening',\n",
       " 'Gay',\n",
       " 'Gender',\n",
       " 'Gender Studies',\n",
       " 'Geography',\n",
       " 'German Literature',\n",
       " 'Germany',\n",
       " 'Ghosts',\n",
       " 'God',\n",
       " 'Gothic',\n",
       " 'Graphic Novels',\n",
       " 'Graphic Novels Comics',\n",
       " 'Graphic Novels Manga',\n",
       " 'Greece',\n",
       " 'Greek Mythology',\n",
       " 'Growth Mindset',\n",
       " 'Guides',\n",
       " 'Halloween',\n",
       " 'Harlequin',\n",
       " 'Health',\n",
       " 'Herbs',\n",
       " 'High Fantasy',\n",
       " 'Hinduism',\n",
       " 'Historical',\n",
       " 'Historical Fantasy',\n",
       " 'Historical Fiction',\n",
       " 'Historical Romance',\n",
       " 'History',\n",
       " 'Holiday',\n",
       " 'Holocaust',\n",
       " 'Horror',\n",
       " 'Horses',\n",
       " 'Horticulture',\n",
       " 'How To',\n",
       " 'Humor',\n",
       " 'India',\n",
       " 'Indian Literature',\n",
       " 'Indonesian Literature',\n",
       " 'Inspirational',\n",
       " 'International',\n",
       " 'Interracial Romance',\n",
       " 'Iran',\n",
       " 'Ireland',\n",
       " 'Irish Literature',\n",
       " 'Islam',\n",
       " 'Italian Literature',\n",
       " 'Japan',\n",
       " 'Japanese Literature',\n",
       " 'Jewish',\n",
       " 'Journalism',\n",
       " 'Judaism',\n",
       " 'Juvenile',\n",
       " 'Kids',\n",
       " 'Komik',\n",
       " 'LGBT',\n",
       " 'Language',\n",
       " 'Latin American',\n",
       " 'Latin American History',\n",
       " 'Latin American Literature',\n",
       " 'Law',\n",
       " 'Lds',\n",
       " 'Lds Fiction',\n",
       " 'Lds Non Fiction',\n",
       " 'Leadership',\n",
       " 'Lesbian',\n",
       " 'Lesbian Fiction',\n",
       " 'Lesbian Romance',\n",
       " 'Light Novel',\n",
       " 'Linguistics',\n",
       " 'Literary Criticism',\n",
       " 'Literary Fiction',\n",
       " 'Literature',\n",
       " 'Logic',\n",
       " 'Love',\n",
       " 'M F Romance',\n",
       " 'M M Romance',\n",
       " 'Magic',\n",
       " 'Magical Realism',\n",
       " 'Magick',\n",
       " 'Management',\n",
       " 'Manga',\n",
       " 'Maritime',\n",
       " 'Marriage',\n",
       " 'Martial Arts',\n",
       " 'Marvel',\n",
       " 'Mathematics',\n",
       " 'Media Tie In',\n",
       " 'Medical',\n",
       " 'Medicine',\n",
       " 'Medieval',\n",
       " 'Medieval History',\n",
       " 'Memoir',\n",
       " 'Mental Health',\n",
       " 'Mental Illness',\n",
       " 'Metaphysics',\n",
       " 'Middle Grade',\n",
       " 'Military Fiction',\n",
       " 'Military History',\n",
       " 'Military Romance',\n",
       " 'Military Science Fiction',\n",
       " 'Modern',\n",
       " 'Money',\n",
       " 'Monsters',\n",
       " 'Mormonism',\n",
       " 'Multicultural Literature',\n",
       " 'Murder Mystery',\n",
       " 'Music',\n",
       " 'Musicians',\n",
       " 'Mystery',\n",
       " 'Mystery Thriller',\n",
       " 'Mysticism',\n",
       " 'Mythology',\n",
       " 'Nature',\n",
       " 'Naval History',\n",
       " 'New Adult',\n",
       " 'New Adult Romance',\n",
       " 'New Testament',\n",
       " 'New York',\n",
       " 'Nobel Prize',\n",
       " 'Nonfiction',\n",
       " 'Novella',\n",
       " 'Novels',\n",
       " 'Nutrition',\n",
       " 'Occult',\n",
       " 'Old Testament',\n",
       " 'Ornithology',\n",
       " 'Outdoors',\n",
       " 'Own',\n",
       " 'Palaeontology',\n",
       " 'Paranormal',\n",
       " 'Paranormal Romance',\n",
       " 'Parenting',\n",
       " 'Personal Development',\n",
       " 'Personal Finance',\n",
       " 'Philosophy',\n",
       " 'Photography',\n",
       " 'Physics',\n",
       " 'Picture Books',\n",
       " 'Plants',\n",
       " 'Plays',\n",
       " 'Poetry',\n",
       " 'Poetry Plays',\n",
       " 'Poland',\n",
       " 'Politics',\n",
       " 'Pop Culture',\n",
       " 'Popular Science',\n",
       " 'Portugal',\n",
       " 'Portuguese Literature',\n",
       " 'Post Apocalyptic',\n",
       " 'Poverty',\n",
       " 'Prayer',\n",
       " 'Princesses',\n",
       " 'Programming',\n",
       " 'Psychoanalysis',\n",
       " 'Psychology',\n",
       " 'Queer',\n",
       " 'Race',\n",
       " 'Read For School',\n",
       " 'Realistic Fiction',\n",
       " 'Reference',\n",
       " 'Regency',\n",
       " 'Relationships',\n",
       " 'Religion',\n",
       " 'Research',\n",
       " 'Retellings',\n",
       " 'Rock N Roll',\n",
       " 'Roman',\n",
       " 'Romance',\n",
       " 'Romanian Literature',\n",
       " 'Romantic',\n",
       " 'Romantic Suspense',\n",
       " 'Russia',\n",
       " 'Russian Literature',\n",
       " 'Scandinavian Literature',\n",
       " 'School',\n",
       " 'Science',\n",
       " 'Science Fiction',\n",
       " 'Science Fiction Fantasy',\n",
       " 'Science Fiction Romance',\n",
       " 'Scotland',\n",
       " 'Scripture',\n",
       " 'Seinen',\n",
       " 'Self Help',\n",
       " 'Sequential Art',\n",
       " 'Serbian Literature',\n",
       " 'Shapeshifters',\n",
       " 'Shojo',\n",
       " 'Shonen',\n",
       " 'Short Stories',\n",
       " 'Short Story Collection',\n",
       " 'Slice Of Life',\n",
       " 'Soccer',\n",
       " 'Social Issues',\n",
       " 'Social Justice',\n",
       " 'Social Work',\n",
       " 'Society',\n",
       " 'Sociology',\n",
       " 'Software',\n",
       " 'South Africa',\n",
       " 'Southern',\n",
       " 'Southern Gothic',\n",
       " 'Soviet Union',\n",
       " 'Space',\n",
       " 'Space Opera',\n",
       " 'Spanish History',\n",
       " 'Spanish Literature',\n",
       " 'Speculative Fiction',\n",
       " 'Spirituality',\n",
       " 'Sports',\n",
       " 'Spy Thriller',\n",
       " 'Steampunk',\n",
       " 'Storytime',\n",
       " 'Students',\n",
       " 'Superheroes',\n",
       " 'Supernatural',\n",
       " 'Survival',\n",
       " 'Suspense',\n",
       " 'Sustainability',\n",
       " 'Sweden',\n",
       " 'Sword and Sorcery',\n",
       " 'Tarot',\n",
       " 'Teachers',\n",
       " 'Teaching',\n",
       " 'Technical',\n",
       " 'Technology',\n",
       " 'Teen',\n",
       " 'Textbooks',\n",
       " 'The United States Of America',\n",
       " 'Theatre',\n",
       " 'Theology',\n",
       " 'Theory',\n",
       " 'Thriller',\n",
       " 'Time Travel',\n",
       " 'Tragedy',\n",
       " 'Transgender',\n",
       " 'Travel',\n",
       " 'True Crime',\n",
       " 'True Story',\n",
       " 'Turkish',\n",
       " 'Turkish Literature',\n",
       " 'Tv',\n",
       " 'Unfinished',\n",
       " 'Urban',\n",
       " 'Urban Fantasy',\n",
       " 'Vampires',\n",
       " 'Vegan',\n",
       " 'Victorian',\n",
       " 'Video Games',\n",
       " 'War',\n",
       " 'Webcomic',\n",
       " 'Werewolves',\n",
       " 'Westerns',\n",
       " 'Wildlife',\n",
       " 'Witchcraft',\n",
       " 'Witches',\n",
       " 'Wizards',\n",
       " 'Wolves',\n",
       " 'Womens',\n",
       " 'World History',\n",
       " 'World War I',\n",
       " 'World War II',\n",
       " 'Writing',\n",
       " 'X Men',\n",
       " 'Young Adult',\n",
       " 'Young Adult Contemporary',\n",
       " 'Young Adult Fantasy',\n",
       " 'Young Adult Romance',\n",
       " 'Young Adult Science Fiction',\n",
       " 'Young Readers',\n",
       " 'Zen',\n",
       " 'Zombies'}"
      ]
     },
     "execution_count": 58,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "set_of_genres = set()\n",
    "for genres in dataset['genres'].values:\n",
    "  for genre in genres:\n",
    "    set_of_genres.add(genre)\n",
    "set_of_genres"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 59,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "456"
      ]
     },
     "execution_count": 59,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(set_of_genres)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 60,
   "metadata": {},
   "outputs": [],
   "source": [
    "for genre in set_of_genres:\n",
    "  insert_genre(genre)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 61,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Generos:\n",
      " - Catholic\n",
      " - Self Help\n",
      " - 14th Century\n",
      " - Fostering\n",
      " - Classic Literature\n",
      " - Fairies\n",
      " - Personal Development\n",
      " - Young Adult Romance\n",
      " - Zen\n",
      " - Novella\n",
      " - The United States Of America\n",
      " - Fairy Tales\n",
      " - Gaming\n",
      " - Realistic Fiction\n",
      " - Military Fiction\n",
      " - Activism\n",
      " - International\n",
      " - Nobel Prize\n",
      " - Christian Non Fiction\n",
      " - 20th Century\n",
      " - Greek Mythology\n",
      " - Steampunk\n",
      " - Spanish Literature\n",
      " - Computers\n",
      " - Aviation\n",
      " - Research\n",
      " - Wildlife\n",
      " - Scripture\n",
      " - Short Stories\n",
      " - Basketball\n",
      " - Abuse\n",
      " - Halloween\n",
      " - Horror\n",
      " - Food\n",
      " - Short Story Collection\n",
      " - Witchcraft\n",
      " - Martial Arts\n",
      " - Students\n",
      " - Dragons\n",
      " - Erotic Paranormal Romance\n",
      " - Ornithology\n",
      " - Asian Literature\n",
      " - Sword and Sorcery\n",
      " - Outdoors\n",
      " - Russian Literature\n",
      " - American History\n",
      " - Storytime\n",
      " - Photography\n",
      " - Physics\n",
      " - Ancient\n",
      " - Writing\n",
      " - Forgotten Realms\n",
      " - Ireland\n",
      " - LGBT\n",
      " - Lds Non Fiction\n",
      " - African American Romance\n",
      " - Conspiracy Theories\n",
      " - Field Guides\n",
      " - Graphic Novels Comics\n",
      " - Social Issues\n",
      " - Art and Photography\n",
      " - Spanish History\n",
      " - Dictionaries\n",
      " - Cyberpunk\n",
      " - Princesses\n",
      " - Rock N Roll\n",
      " - American\n",
      " - Social Work\n",
      " - Geography\n",
      " - Cats\n",
      " - Historical\n",
      " - Biblical\n",
      " - Espionage\n",
      " - Romantic Suspense\n",
      " - Historical Romance\n",
      " - Christian Historical Fiction\n",
      " - Sports\n",
      " - Church\n",
      " - Dark Fantasy\n",
      " - Chick Lit\n",
      " - Football\n",
      " - Vampires\n",
      " - Vegan\n",
      " - English Literature\n",
      " - Gender\n",
      " - X Men\n",
      " - Modern\n",
      " - Divination\n",
      " - Literature\n",
      " - Christian Living\n",
      " - Dungeons and Dragons\n",
      " - Animal Fiction\n",
      " - Tv\n",
      " - Futuristic\n",
      " - Marvel\n",
      " - Military Science Fiction\n",
      " - Childrens Classics\n",
      " - Memoir\n",
      " - Southern\n",
      " - Journalism\n",
      " - Paranormal Romance\n",
      " - M M Romance\n",
      " - Tarot\n",
      " - Popular Science\n",
      " - Spy Thriller\n",
      " - Eastern Philosophy\n",
      " - Suspense\n",
      " - Dystopia\n",
      " - Wolves\n",
      " - Queer\n",
      " - Regency\n",
      " - Academic\n",
      " - Canada\n",
      " - Fantasy\n",
      " - Medieval History\n",
      " - Latin American\n",
      " - Kids\n",
      " - Germany\n",
      " - Speculative Fiction\n",
      " - Theory\n",
      " - Turkish Literature\n",
      " - Health\n",
      " - Supernatural\n",
      " - Lds Fiction\n",
      " - Dark\n",
      " - Birds\n",
      " - Lesbian\n",
      " - Africa\n",
      " - Lesbian Fiction\n",
      " - Mental Illness\n",
      " - Time Travel\n",
      " - Coding\n",
      " - Herbs\n",
      " - Cookbooks\n",
      " - Nutrition\n",
      " - Cinderella\n",
      " - Old Testament\n",
      " - Poetry Plays\n",
      " - Computer Science\n",
      " - Social Justice\n",
      " - Japanese Literature\n",
      " - Contemporary\n",
      " - Collections\n",
      " - Mathematics\n",
      " - Technology\n",
      " - Mental Health\n",
      " - 19th Century\n",
      " - Technical\n",
      " - Shapeshifters\n",
      " - Esoterica\n",
      " - Sustainability\n",
      " - Naval History\n",
      " - Young Adult\n",
      " - 1st Grade\n",
      " - Fairy Tale Retellings\n",
      " - Survival\n",
      " - Boarding School\n",
      " - Adventure\n",
      " - Guides\n",
      " - Family\n",
      " - Scandinavian Literature\n",
      " - Southern Gothic\n",
      " - Cozy Mystery\n",
      " - Nature\n",
      " - Plays\n",
      " - Book Club\n",
      " - Management\n",
      " - Portugal\n",
      " - Psychoanalysis\n",
      " - Chapter Books\n",
      " - Religion\n",
      " - Mysticism\n",
      " - Young Readers\n",
      " - Judaism\n",
      " - Humor\n",
      " - Read For School\n",
      " - Lesbian Romance\n",
      " - Biography Memoir\n",
      " - Contemporary Romance\n",
      " - Dc Comics\n",
      " - Shonen\n",
      " - Own\n",
      " - Novels\n",
      " - Anime\n",
      " - Baha I\n",
      " - How To\n",
      " - True Crime\n",
      " - Urban\n",
      " - Mystery Thriller\n",
      " - Erotica\n",
      " - Detective\n",
      " - Biblical Fiction\n",
      " - Komik\n",
      " - Occult\n",
      " - Anti Racist\n",
      " - Logic\n",
      " - Murder Mystery\n",
      " - Erotic Romance\n",
      " - Evolution\n",
      " - Science\n",
      " - Epic\n",
      " - Cultural\n",
      " - Christian\n",
      " - Fandom\n",
      " - Manga\n",
      " - Counselling\n",
      " - African American Literature\n",
      " - Civil War\n",
      " - Holocaust\n",
      " - Lds\n",
      " - Fire Services\n",
      " - Society\n",
      " - Prayer\n",
      " - School\n",
      " - Serbian Literature\n",
      " - Coming Of Age\n",
      " - Interracial Romance\n",
      " - Epic Fantasy\n",
      " - Crime\n",
      " - Folk Tales\n",
      " - Adult\n",
      " - Batman\n",
      " - Harlequin\n",
      " - Werewolves\n",
      " - Classics\n",
      " - Diets\n",
      " - Video Games\n",
      " - Alchemy\n",
      " - India\n",
      " - Fantasy Romance\n",
      " - Audiobook\n",
      " - Hinduism\n",
      " - German Literature\n",
      " - Angels\n",
      " - Transgender\n",
      " - Islam\n",
      " - Irish Literature\n",
      " - Marriage\n",
      " - Horticulture\n",
      " - Fae\n",
      " - European History\n",
      " - Webcomic\n",
      " - Faith\n",
      " - Criticism\n",
      " - World War I\n",
      " - Aliens\n",
      " - Books About Books\n",
      " - Folklore\n",
      " - Latin American Literature\n",
      " - Soviet Union\n",
      " - Language\n",
      " - Feminism\n",
      " - Gothic\n",
      " - Death\n",
      " - Anthropology\n",
      " - Space\n",
      " - Architecture\n",
      " - Science Fiction Romance\n",
      " - Paranormal\n",
      " - Latin American History\n",
      " - Tragedy\n",
      " - Pop Culture\n",
      " - Art\n",
      " - Comedy\n",
      " - Astrology\n",
      " - God\n",
      " - Clean Romance\n",
      " - Money\n",
      " - Dogs\n",
      " - Adult Fiction\n",
      " - BDSM\n",
      " - Philosophy\n",
      " - Womens\n",
      " - Multicultural Literature\n",
      " - Cooking\n",
      " - Education\n",
      " - Chess\n",
      " - French Literature\n",
      " - Travel\n",
      " - Christmas\n",
      " - Scotland\n",
      " - Turkish\n",
      " - Teachers\n",
      " - Juvenile\n",
      " - Space Opera\n",
      " - Reference\n",
      " - Musicians\n",
      " - African American\n",
      " - Action\n",
      " - Politics\n",
      " - Sociology\n",
      " - Civil War History\n",
      " - Retellings\n",
      " - Christian Romance\n",
      " - Monsters\n",
      " - Mormonism\n",
      " - Poverty\n",
      " - Military Romance\n",
      " - Young Adult Fantasy\n",
      " - New Testament\n",
      " - Maritime\n",
      " - Graphic Novels\n",
      " - Japan\n",
      " - 18th Century\n",
      " - War\n",
      " - Christian Fiction\n",
      " - Aeroplanes\n",
      " - Light Novel\n",
      " - Design\n",
      " - Anthropomorphic\n",
      " - Drama\n",
      " - Relationships\n",
      " - Medical\n",
      " - Disability\n",
      " - Middle Grade\n",
      " - Church History\n",
      " - Asia\n",
      " - Literary Criticism\n",
      " - Graphic Novels Manga\n",
      " - Mythology\n",
      " - Music\n",
      " - Animals\n",
      " - Agriculture\n",
      " - Plants\n",
      " - Cartoon\n",
      " - Textbooks\n",
      " - 21st Century\n",
      " - Picture Books\n",
      " - Sequential Art\n",
      " - Romantic\n",
      " - New Adult Romance\n",
      " - Buddhism\n",
      " - New York\n",
      " - Christianity\n",
      " - Christian Fantasy\n",
      " - Crafts\n",
      " - Law\n",
      " - Finance\n",
      " - Sweden\n",
      " - Programming\n",
      " - High Fantasy\n",
      " - Comic Book\n",
      " - Indian Literature\n",
      " - Victorian\n",
      " - Childrens\n",
      " - Wizards\n",
      " - Personal Finance\n",
      " - Comics Manga\n",
      " - Portuguese Literature\n",
      " - Teaching\n",
      " - Post Apocalyptic\n",
      " - Australia\n",
      " - Magick\n",
      " - Theology\n",
      " - History\n",
      " - College\n",
      " - Greece\n",
      " - Science Fiction Fantasy\n",
      " - South Africa\n",
      " - Science Fiction\n",
      " - Iran\n",
      " - Military History\n",
      " - Essays\n",
      " - Fashion\n",
      " - Software\n",
      " - Unfinished\n",
      " - Autobiography\n",
      " - Ecology\n",
      " - Shojo\n",
      " - Alternate History\n",
      " - Medieval\n",
      " - Anthologies\n",
      " - Holiday\n",
      " - Gender Studies\n",
      " - Climate Change Fiction\n",
      " - British Literature\n",
      " - Games\n",
      " - Film\n",
      " - Art History\n",
      " - Ghosts\n",
      " - Superheroes\n",
      " - Historical Fiction\n",
      " - Demons\n",
      " - Food and Drink\n",
      " - Fiction\n",
      " - Young Adult Science Fiction\n",
      " - Magic\n",
      " - Historical Fantasy\n",
      " - Entrepreneurship\n",
      " - Metaphysics\n",
      " - New Adult\n",
      " - Economics\n",
      " - Seinen\n",
      " - Jewish\n",
      " - Romance\n",
      " - Roman\n",
      " - Race\n",
      " - Leadership\n",
      " - Thriller\n",
      " - Magical Realism\n",
      " - Literary Fiction\n",
      " - Zombies\n",
      " - Comic Strips\n",
      " - Psychology\n",
      " - Young Adult Contemporary\n",
      " - M F Romance\n",
      " - Horses\n",
      " - Parenting\n",
      " - Comix\n",
      " - Palaeontology\n",
      " - World War II\n",
      " - Colouring Books\n",
      " - Media Tie In\n",
      " - Italian Literature\n",
      " - 40k\n",
      " - Czech Literature\n",
      " - Business\n",
      " - Astronomy\n",
      " - Nonfiction\n",
      " - Linguistics\n",
      " - True Story\n",
      " - Soccer\n",
      " - France\n",
      " - Buisness\n",
      " - American Civil War\n",
      " - Americana\n",
      " - Medicine\n",
      " - Poetry\n",
      " - Russia\n",
      " - Dinosaurs\n",
      " - Westerns\n",
      " - Gay\n",
      " - Biology\n",
      " - Poland\n",
      " - Witches\n",
      " - Teen\n",
      " - Indonesian Literature\n",
      " - Biography\n",
      " - Urban Fantasy\n",
      " - Love\n",
      " - Romanian Literature\n",
      " - Theatre\n",
      " - Comics\n",
      " - Inspirational\n",
      " - Spirituality\n",
      " - Mystery\n",
      " - American Fiction\n",
      " - Ancient History\n",
      " - Growth Mindset\n",
      " - Elves\n",
      " - Slice Of Life\n",
      " - 16th Century\n",
      " - Doctor Who\n",
      " - World History\n",
      " - Gardening\n",
      " - Environment\n"
     ]
    }
   ],
   "source": [
    "show_genres()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Insert books"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 65,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "execution_count": 65,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "insert_books(dataset)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 70,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['Five Complete Hercule Poirot Novels: ABC Murders / Cards on the Table / Death on the Nile / Murder on the Orient Express / Thirteen at Dinner - Agatha Christie',\n",
       " 'Pharmako/Poeia: Plant Powers, Poisons, and Herbcraft - Dale Pendell',\n",
       " 'The Abhorsen Trilogy Box Set - Garth Nix',\n",
       " 'Wildfire - Ilona Andrews',\n",
       " 'J.R.R. Tolkien 4-Book Boxed Set: The Hobbit and The Lord of the Rings - J.R.R. Tolkien']"
      ]
     },
     "execution_count": 70,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "books = get_random_books(5)\n",
    "[f\"{b[\"title\"]} - {b[\"author\"]}\" for b in books]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Friend relationship"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 105,
   "metadata": {},
   "outputs": [],
   "source": [
    "user1 = \"Victor\"\n",
    "user2 = \"Angel\"\n",
    "make_relation(user1, \"User\", user2, \"User\", \"FRIEND\")\n",
    "make_relation(user2, \"User\", user1, \"User\", \"FRIEND\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 98,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Vinculos:\n",
      " - Badre es amigo de Victor\n",
      " - Victor es amigo de Badre\n",
      " - Daniel es amigo de Victor\n",
      " - Victor es amigo de Daniel\n"
     ]
    }
   ],
   "source": [
    "# Mostrar vinculos\n",
    "print(\"\\nVinculos:\")\n",
    "result = session.run(\"MATCH (u:User)-[r:FRIEND]->(u2:User) RETURN u.name AS name, u2.name AS name2\")\n",
    "for record in result:\n",
    "  print(f\" - {record['name']} es amigo de {record['name2']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Genre relationship"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 112,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Manhood Of Humanity - The Science And Art Of Human Engineering\n"
     ]
    },
    {
     "ename": "BufferError",
     "evalue": "Existing exports of data: object cannot be re-sized",
     "output_type": "error",
     "traceback": [
      "\u001b[1;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[1;31mBufferError\u001b[0m                               Traceback (most recent call last)",
      "Cell \u001b[1;32mIn[112], line 4\u001b[0m\n\u001b[0;32m      2\u001b[0m \u001b[38;5;28mprint\u001b[39m(row[\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mtitle\u001b[39m\u001b[38;5;124m\"\u001b[39m])\n\u001b[0;32m      3\u001b[0m \u001b[38;5;28;01mfor\u001b[39;00m genre \u001b[38;5;129;01min\u001b[39;00m row[\u001b[38;5;124m'\u001b[39m\u001b[38;5;124mgenres\u001b[39m\u001b[38;5;124m'\u001b[39m]:\n\u001b[1;32m----> 4\u001b[0m   \u001b[43mmake_relation\u001b[49m\u001b[43m(\u001b[49m\u001b[43mrow\u001b[49m\u001b[43m[\u001b[49m\u001b[38;5;124;43m'\u001b[39;49m\u001b[38;5;124;43mtitle\u001b[39;49m\u001b[38;5;124;43m'\u001b[39;49m\u001b[43m]\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43mBook\u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mgenre\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43mGenre\u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43mBELONG_TO\u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[43m)\u001b[49m\n",
      "Cell \u001b[1;32mIn[82], line 104\u001b[0m, in \u001b[0;36mmake_relation\u001b[1;34m(a_name, a_type, b_name, b_type, relation)\u001b[0m\n\u001b[0;32m     96\u001b[0m query \u001b[38;5;241m=\u001b[39m \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mMATCH (a:\u001b[39m\u001b[38;5;124m\"\u001b[39m \u001b[38;5;241m+\u001b[39m a_type \u001b[38;5;241m+\u001b[39m \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124m \u001b[39m\u001b[38;5;124m{\u001b[39m\u001b[38;5;124mname: $a_name}),\u001b[39m\u001b[38;5;124m\"\u001b[39m\\\n\u001b[0;32m     97\u001b[0m       \u001b[38;5;241m+\u001b[39m       \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124m(b:\u001b[39m\u001b[38;5;124m\"\u001b[39m \u001b[38;5;241m+\u001b[39m b_type \u001b[38;5;241m+\u001b[39m \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124m \u001b[39m\u001b[38;5;124m{\u001b[39m\u001b[38;5;124mname: $b_name})\u001b[39m\u001b[38;5;124m\"\u001b[39m\\\n\u001b[0;32m     98\u001b[0m       \u001b[38;5;241m+\u001b[39m \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mCREATE (a)-[:\u001b[39m\u001b[38;5;124m\"\u001b[39m \u001b[38;5;241m+\u001b[39m relation \u001b[38;5;241m+\u001b[39m \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124m]->(b)\u001b[39m\u001b[38;5;124m\"\u001b[39m\n\u001b[0;32m     99\u001b[0m attr \u001b[38;5;241m=\u001b[39m {\n\u001b[0;32m    100\u001b[0m   \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124ma_name\u001b[39m\u001b[38;5;124m\"\u001b[39m: a_name, \n\u001b[0;32m    101\u001b[0m   \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mb_name\u001b[39m\u001b[38;5;124m\"\u001b[39m: b_name\n\u001b[0;32m    102\u001b[0m   }\n\u001b[1;32m--> 104\u001b[0m \u001b[43msession\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mrun\u001b[49m\u001b[43m(\u001b[49m\u001b[43mquery\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mattr\u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[1;32mc:\\Users\\victo\\Desktop\\3a_Entrada\\neo4j_ML\\venv\\Lib\\site-packages\\neo4j\\_sync\\work\\session.py:313\u001b[0m, in \u001b[0;36mSession.run\u001b[1;34m(self, query, parameters, **kwargs)\u001b[0m\n\u001b[0;32m    311\u001b[0m bookmarks \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_get_bookmarks()\n\u001b[0;32m    312\u001b[0m parameters \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mdict\u001b[39m(parameters \u001b[38;5;129;01mor\u001b[39;00m {}, \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mkwargs)\n\u001b[1;32m--> 313\u001b[0m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_auto_result\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_run\u001b[49m\u001b[43m(\u001b[49m\n\u001b[0;32m    314\u001b[0m \u001b[43m    \u001b[49m\u001b[43mquery\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mparameters\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_config\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mdatabase\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    315\u001b[0m \u001b[43m    \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_config\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mimpersonated_user\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_config\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mdefault_access_mode\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    316\u001b[0m \u001b[43m    \u001b[49m\u001b[43mbookmarks\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_config\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mnotifications_min_severity\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    317\u001b[0m \u001b[43m    \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_config\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mnotifications_disabled_categories\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    318\u001b[0m \u001b[43m\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    320\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_auto_result\n",
      "File \u001b[1;32mc:\\Users\\victo\\Desktop\\3a_Entrada\\neo4j_ML\\venv\\Lib\\site-packages\\neo4j\\_sync\\work\\result.py:181\u001b[0m, in \u001b[0;36mResult._run\u001b[1;34m(self, query, parameters, db, imp_user, access_mode, bookmarks, notifications_min_severity, notifications_disabled_categories)\u001b[0m\n\u001b[0;32m    179\u001b[0m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_pull()\n\u001b[0;32m    180\u001b[0m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_connection\u001b[38;5;241m.\u001b[39msend_all()\n\u001b[1;32m--> 181\u001b[0m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_attach\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[1;32mc:\\Users\\victo\\Desktop\\3a_Entrada\\neo4j_ML\\venv\\Lib\\site-packages\\neo4j\\_sync\\work\\result.py:301\u001b[0m, in \u001b[0;36mResult._attach\u001b[1;34m(self)\u001b[0m\n\u001b[0;32m    299\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_exhausted \u001b[38;5;129;01mis\u001b[39;00m \u001b[38;5;28;01mFalse\u001b[39;00m:\n\u001b[0;32m    300\u001b[0m     \u001b[38;5;28;01mwhile\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_attached \u001b[38;5;129;01mis\u001b[39;00m \u001b[38;5;28;01mFalse\u001b[39;00m:\n\u001b[1;32m--> 301\u001b[0m         \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_connection\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mfetch_message\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[1;32mc:\\Users\\victo\\Desktop\\3a_Entrada\\neo4j_ML\\venv\\Lib\\site-packages\\neo4j\\_sync\\io\\_common.py:178\u001b[0m, in \u001b[0;36mConnectionErrorHandler.__getattr__.<locals>.outer.<locals>.inner\u001b[1;34m(*args, **kwargs)\u001b[0m\n\u001b[0;32m    176\u001b[0m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21minner\u001b[39m(\u001b[38;5;241m*\u001b[39margs, \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mkwargs):\n\u001b[0;32m    177\u001b[0m     \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[1;32m--> 178\u001b[0m         \u001b[43mfunc\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[43margs\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[43mkwargs\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    179\u001b[0m     \u001b[38;5;28;01mexcept\u001b[39;00m (Neo4jError, ServiceUnavailable, SessionExpired) \u001b[38;5;28;01mas\u001b[39;00m exc:\n\u001b[0;32m    180\u001b[0m         \u001b[38;5;28;01massert\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m asyncio\u001b[38;5;241m.\u001b[39miscoroutinefunction(\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m__on_error)\n",
      "File \u001b[1;32mc:\\Users\\victo\\Desktop\\3a_Entrada\\neo4j_ML\\venv\\Lib\\site-packages\\neo4j\\_sync\\io\\_bolt.py:847\u001b[0m, in \u001b[0;36mBolt.fetch_message\u001b[1;34m(self)\u001b[0m\n\u001b[0;32m    844\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;241m0\u001b[39m, \u001b[38;5;241m0\u001b[39m\n\u001b[0;32m    846\u001b[0m \u001b[38;5;66;03m# Receive exactly one message\u001b[39;00m\n\u001b[1;32m--> 847\u001b[0m tag, fields \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43minbox\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mpop\u001b[49m\u001b[43m(\u001b[49m\n\u001b[0;32m    848\u001b[0m \u001b[43m    \u001b[49m\u001b[43mhydration_hooks\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mresponses\u001b[49m\u001b[43m[\u001b[49m\u001b[38;5;241;43m0\u001b[39;49m\u001b[43m]\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mhydration_hooks\u001b[49m\n\u001b[0;32m    849\u001b[0m \u001b[43m\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    850\u001b[0m res \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_process_message(tag, fields)\n\u001b[0;32m    851\u001b[0m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39midle_since \u001b[38;5;241m=\u001b[39m monotonic()\n",
      "File \u001b[1;32mc:\\Users\\victo\\Desktop\\3a_Entrada\\neo4j_ML\\venv\\Lib\\site-packages\\neo4j\\_sync\\io\\_common.py:72\u001b[0m, in \u001b[0;36mInbox.pop\u001b[1;34m(self, hydration_hooks)\u001b[0m\n\u001b[0;32m     71\u001b[0m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21mpop\u001b[39m(\u001b[38;5;28mself\u001b[39m, hydration_hooks):\n\u001b[1;32m---> 72\u001b[0m     \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_buffer_one_chunk\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m     73\u001b[0m     \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[0;32m     74\u001b[0m         size, tag \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_unpacker\u001b[38;5;241m.\u001b[39munpack_structure_header()\n",
      "File \u001b[1;32mc:\\Users\\victo\\Desktop\\3a_Entrada\\neo4j_ML\\venv\\Lib\\site-packages\\neo4j\\_sync\\io\\_common.py:56\u001b[0m, in \u001b[0;36mInbox._buffer_one_chunk\u001b[1;34m(self)\u001b[0m\n\u001b[0;32m     53\u001b[0m     \u001b[38;5;28;01mif\u001b[39;00m chunk_size \u001b[38;5;241m==\u001b[39m \u001b[38;5;241m0\u001b[39m:\n\u001b[0;32m     54\u001b[0m         log\u001b[38;5;241m.\u001b[39mdebug(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124m[#\u001b[39m\u001b[38;5;132;01m%04X\u001b[39;00m\u001b[38;5;124m]  S: <NOOP>\u001b[39m\u001b[38;5;124m\"\u001b[39m, \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_local_port)\n\u001b[1;32m---> 56\u001b[0m \u001b[43mreceive_into_buffer\u001b[49m\u001b[43m(\u001b[49m\n\u001b[0;32m     57\u001b[0m \u001b[43m    \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_socket\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_buffer\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mchunk_size\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;241;43m+\u001b[39;49m\u001b[43m \u001b[49m\u001b[38;5;241;43m2\u001b[39;49m\n\u001b[0;32m     58\u001b[0m \u001b[43m\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m     59\u001b[0m chunk_size \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_buffer\u001b[38;5;241m.\u001b[39mpop_u16()\n\u001b[0;32m     61\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m chunk_size \u001b[38;5;241m==\u001b[39m \u001b[38;5;241m0\u001b[39m:\n\u001b[0;32m     62\u001b[0m     \u001b[38;5;66;03m# chunk_size was the end marker for the message\u001b[39;00m\n",
      "File \u001b[1;32mc:\\Users\\victo\\Desktop\\3a_Entrada\\neo4j_ML\\venv\\Lib\\site-packages\\neo4j\\_sync\\io\\_common.py:323\u001b[0m, in \u001b[0;36mreceive_into_buffer\u001b[1;34m(sock, buffer, n_bytes)\u001b[0m\n\u001b[0;32m    321\u001b[0m end \u001b[38;5;241m=\u001b[39m buffer\u001b[38;5;241m.\u001b[39mused \u001b[38;5;241m+\u001b[39m n_bytes\n\u001b[0;32m    322\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m end \u001b[38;5;241m>\u001b[39m \u001b[38;5;28mlen\u001b[39m(buffer\u001b[38;5;241m.\u001b[39mdata):\n\u001b[1;32m--> 323\u001b[0m     \u001b[43mbuffer\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mdata\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;241;43m+\u001b[39;49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43m \u001b[49m\u001b[38;5;28;43mbytearray\u001b[39;49m\u001b[43m(\u001b[49m\u001b[43mend\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;241;43m-\u001b[39;49m\u001b[43m \u001b[49m\u001b[38;5;28;43mlen\u001b[39;49m\u001b[43m(\u001b[49m\u001b[43mbuffer\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mdata\u001b[49m\u001b[43m)\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    324\u001b[0m \u001b[38;5;28;01mwith\u001b[39;00m \u001b[38;5;28mmemoryview\u001b[39m(buffer\u001b[38;5;241m.\u001b[39mdata) \u001b[38;5;28;01mas\u001b[39;00m view:\n\u001b[0;32m    325\u001b[0m     \u001b[38;5;28;01mwhile\u001b[39;00m buffer\u001b[38;5;241m.\u001b[39mused \u001b[38;5;241m<\u001b[39m end:\n",
      "\u001b[1;31mBufferError\u001b[0m: Existing exports of data: object cannot be re-sized"
     ]
    }
   ],
   "source": [
    "for _, row in dataset.iterrows():\n",
    "  print(row[\"title\"])\n",
    "  for genre in row['genres']:\n",
    "    make_relation(row['title'], \"Book\", genre, \"Genre\", \"BELONG_TO\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 111,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Vinculos:\n"
     ]
    },
    {
     "ename": "BufferError",
     "evalue": "Existing exports of data: object cannot be re-sized",
     "output_type": "error",
     "traceback": [
      "\u001b[1;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[1;31mBufferError\u001b[0m                               Traceback (most recent call last)",
      "Cell \u001b[1;32mIn[111], line 2\u001b[0m\n\u001b[0;32m      1\u001b[0m \u001b[38;5;28mprint\u001b[39m(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;130;01m\\n\u001b[39;00m\u001b[38;5;124mVinculos:\u001b[39m\u001b[38;5;124m\"\u001b[39m)\n\u001b[1;32m----> 2\u001b[0m result \u001b[38;5;241m=\u001b[39m \u001b[43msession\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mrun\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43mMATCH (b:Book)-[r:BELONG_TO]->(g:Genre) RETURN b.name AS name, g.name AS name2\u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[43m)\u001b[49m\n\u001b[0;32m      3\u001b[0m \u001b[38;5;28;01mfor\u001b[39;00m record \u001b[38;5;129;01min\u001b[39;00m result:\n\u001b[0;32m      4\u001b[0m   \u001b[38;5;28mprint\u001b[39m(\u001b[38;5;124mf\u001b[39m\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124m - \u001b[39m\u001b[38;5;132;01m{\u001b[39;00mrecord[\u001b[38;5;124m'\u001b[39m\u001b[38;5;124mname\u001b[39m\u001b[38;5;124m'\u001b[39m]\u001b[38;5;132;01m}\u001b[39;00m\u001b[38;5;124m pertenece a \u001b[39m\u001b[38;5;132;01m{\u001b[39;00mrecord[\u001b[38;5;124m'\u001b[39m\u001b[38;5;124mname2\u001b[39m\u001b[38;5;124m'\u001b[39m]\u001b[38;5;132;01m}\u001b[39;00m\u001b[38;5;124m\"\u001b[39m)\n",
      "File \u001b[1;32mc:\\Users\\victo\\Desktop\\3a_Entrada\\neo4j_ML\\venv\\Lib\\site-packages\\neo4j\\_sync\\work\\session.py:313\u001b[0m, in \u001b[0;36mSession.run\u001b[1;34m(self, query, parameters, **kwargs)\u001b[0m\n\u001b[0;32m    311\u001b[0m bookmarks \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_get_bookmarks()\n\u001b[0;32m    312\u001b[0m parameters \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mdict\u001b[39m(parameters \u001b[38;5;129;01mor\u001b[39;00m {}, \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mkwargs)\n\u001b[1;32m--> 313\u001b[0m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_auto_result\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_run\u001b[49m\u001b[43m(\u001b[49m\n\u001b[0;32m    314\u001b[0m \u001b[43m    \u001b[49m\u001b[43mquery\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mparameters\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_config\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mdatabase\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    315\u001b[0m \u001b[43m    \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_config\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mimpersonated_user\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_config\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mdefault_access_mode\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    316\u001b[0m \u001b[43m    \u001b[49m\u001b[43mbookmarks\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_config\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mnotifications_min_severity\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    317\u001b[0m \u001b[43m    \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_config\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mnotifications_disabled_categories\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    318\u001b[0m \u001b[43m\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    320\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_auto_result\n",
      "File \u001b[1;32mc:\\Users\\victo\\Desktop\\3a_Entrada\\neo4j_ML\\venv\\Lib\\site-packages\\neo4j\\_sync\\work\\result.py:181\u001b[0m, in \u001b[0;36mResult._run\u001b[1;34m(self, query, parameters, db, imp_user, access_mode, bookmarks, notifications_min_severity, notifications_disabled_categories)\u001b[0m\n\u001b[0;32m    179\u001b[0m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_pull()\n\u001b[0;32m    180\u001b[0m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_connection\u001b[38;5;241m.\u001b[39msend_all()\n\u001b[1;32m--> 181\u001b[0m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_attach\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[1;32mc:\\Users\\victo\\Desktop\\3a_Entrada\\neo4j_ML\\venv\\Lib\\site-packages\\neo4j\\_sync\\work\\result.py:301\u001b[0m, in \u001b[0;36mResult._attach\u001b[1;34m(self)\u001b[0m\n\u001b[0;32m    299\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_exhausted \u001b[38;5;129;01mis\u001b[39;00m \u001b[38;5;28;01mFalse\u001b[39;00m:\n\u001b[0;32m    300\u001b[0m     \u001b[38;5;28;01mwhile\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_attached \u001b[38;5;129;01mis\u001b[39;00m \u001b[38;5;28;01mFalse\u001b[39;00m:\n\u001b[1;32m--> 301\u001b[0m         \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_connection\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mfetch_message\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[1;32mc:\\Users\\victo\\Desktop\\3a_Entrada\\neo4j_ML\\venv\\Lib\\site-packages\\neo4j\\_sync\\io\\_common.py:178\u001b[0m, in \u001b[0;36mConnectionErrorHandler.__getattr__.<locals>.outer.<locals>.inner\u001b[1;34m(*args, **kwargs)\u001b[0m\n\u001b[0;32m    176\u001b[0m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21minner\u001b[39m(\u001b[38;5;241m*\u001b[39margs, \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mkwargs):\n\u001b[0;32m    177\u001b[0m     \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[1;32m--> 178\u001b[0m         \u001b[43mfunc\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[43margs\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[43mkwargs\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    179\u001b[0m     \u001b[38;5;28;01mexcept\u001b[39;00m (Neo4jError, ServiceUnavailable, SessionExpired) \u001b[38;5;28;01mas\u001b[39;00m exc:\n\u001b[0;32m    180\u001b[0m         \u001b[38;5;28;01massert\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m asyncio\u001b[38;5;241m.\u001b[39miscoroutinefunction(\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m__on_error)\n",
      "File \u001b[1;32mc:\\Users\\victo\\Desktop\\3a_Entrada\\neo4j_ML\\venv\\Lib\\site-packages\\neo4j\\_sync\\io\\_bolt.py:847\u001b[0m, in \u001b[0;36mBolt.fetch_message\u001b[1;34m(self)\u001b[0m\n\u001b[0;32m    844\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;241m0\u001b[39m, \u001b[38;5;241m0\u001b[39m\n\u001b[0;32m    846\u001b[0m \u001b[38;5;66;03m# Receive exactly one message\u001b[39;00m\n\u001b[1;32m--> 847\u001b[0m tag, fields \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43minbox\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mpop\u001b[49m\u001b[43m(\u001b[49m\n\u001b[0;32m    848\u001b[0m \u001b[43m    \u001b[49m\u001b[43mhydration_hooks\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mresponses\u001b[49m\u001b[43m[\u001b[49m\u001b[38;5;241;43m0\u001b[39;49m\u001b[43m]\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mhydration_hooks\u001b[49m\n\u001b[0;32m    849\u001b[0m \u001b[43m\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    850\u001b[0m res \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_process_message(tag, fields)\n\u001b[0;32m    851\u001b[0m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39midle_since \u001b[38;5;241m=\u001b[39m monotonic()\n",
      "File \u001b[1;32mc:\\Users\\victo\\Desktop\\3a_Entrada\\neo4j_ML\\venv\\Lib\\site-packages\\neo4j\\_sync\\io\\_common.py:72\u001b[0m, in \u001b[0;36mInbox.pop\u001b[1;34m(self, hydration_hooks)\u001b[0m\n\u001b[0;32m     71\u001b[0m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21mpop\u001b[39m(\u001b[38;5;28mself\u001b[39m, hydration_hooks):\n\u001b[1;32m---> 72\u001b[0m     \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_buffer_one_chunk\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m     73\u001b[0m     \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[0;32m     74\u001b[0m         size, tag \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_unpacker\u001b[38;5;241m.\u001b[39munpack_structure_header()\n",
      "File \u001b[1;32mc:\\Users\\victo\\Desktop\\3a_Entrada\\neo4j_ML\\venv\\Lib\\site-packages\\neo4j\\_sync\\io\\_common.py:56\u001b[0m, in \u001b[0;36mInbox._buffer_one_chunk\u001b[1;34m(self)\u001b[0m\n\u001b[0;32m     53\u001b[0m     \u001b[38;5;28;01mif\u001b[39;00m chunk_size \u001b[38;5;241m==\u001b[39m \u001b[38;5;241m0\u001b[39m:\n\u001b[0;32m     54\u001b[0m         log\u001b[38;5;241m.\u001b[39mdebug(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124m[#\u001b[39m\u001b[38;5;132;01m%04X\u001b[39;00m\u001b[38;5;124m]  S: <NOOP>\u001b[39m\u001b[38;5;124m\"\u001b[39m, \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_local_port)\n\u001b[1;32m---> 56\u001b[0m \u001b[43mreceive_into_buffer\u001b[49m\u001b[43m(\u001b[49m\n\u001b[0;32m     57\u001b[0m \u001b[43m    \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_socket\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_buffer\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mchunk_size\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;241;43m+\u001b[39;49m\u001b[43m \u001b[49m\u001b[38;5;241;43m2\u001b[39;49m\n\u001b[0;32m     58\u001b[0m \u001b[43m\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m     59\u001b[0m chunk_size \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_buffer\u001b[38;5;241m.\u001b[39mpop_u16()\n\u001b[0;32m     61\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m chunk_size \u001b[38;5;241m==\u001b[39m \u001b[38;5;241m0\u001b[39m:\n\u001b[0;32m     62\u001b[0m     \u001b[38;5;66;03m# chunk_size was the end marker for the message\u001b[39;00m\n",
      "File \u001b[1;32mc:\\Users\\victo\\Desktop\\3a_Entrada\\neo4j_ML\\venv\\Lib\\site-packages\\neo4j\\_sync\\io\\_common.py:323\u001b[0m, in \u001b[0;36mreceive_into_buffer\u001b[1;34m(sock, buffer, n_bytes)\u001b[0m\n\u001b[0;32m    321\u001b[0m end \u001b[38;5;241m=\u001b[39m buffer\u001b[38;5;241m.\u001b[39mused \u001b[38;5;241m+\u001b[39m n_bytes\n\u001b[0;32m    322\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m end \u001b[38;5;241m>\u001b[39m \u001b[38;5;28mlen\u001b[39m(buffer\u001b[38;5;241m.\u001b[39mdata):\n\u001b[1;32m--> 323\u001b[0m     \u001b[43mbuffer\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mdata\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;241;43m+\u001b[39;49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43m \u001b[49m\u001b[38;5;28;43mbytearray\u001b[39;49m\u001b[43m(\u001b[49m\u001b[43mend\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;241;43m-\u001b[39;49m\u001b[43m \u001b[49m\u001b[38;5;28;43mlen\u001b[39;49m\u001b[43m(\u001b[49m\u001b[43mbuffer\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mdata\u001b[49m\u001b[43m)\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    324\u001b[0m \u001b[38;5;28;01mwith\u001b[39;00m \u001b[38;5;28mmemoryview\u001b[39m(buffer\u001b[38;5;241m.\u001b[39mdata) \u001b[38;5;28;01mas\u001b[39;00m view:\n\u001b[0;32m    325\u001b[0m     \u001b[38;5;28;01mwhile\u001b[39;00m buffer\u001b[38;5;241m.\u001b[39mused \u001b[38;5;241m<\u001b[39m end:\n",
      "\u001b[1;31mBufferError\u001b[0m: Existing exports of data: object cannot be re-sized"
     ]
    }
   ],
   "source": [
    "print(\"\\nVinculos:\")\n",
    "result = session.run(\"MATCH (b:Book)-[r:BELONG_TO]->(g:Genre) RETURN b.name AS name, g.name AS name2\")\n",
    "for record in result:\n",
    "  print(f\" - {record['name']} pertenece a {record['name2']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Close Connection"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 64,
   "metadata": {},
   "outputs": [],
   "source": [
    "# session.close()\n",
    "# driver.close()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
